gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V3XJ

/* CCP signatures */
typedef enum CCP_enum
{
    CCP_SPM_gc = (0x9D<<0),  /* SPM Instruction Protection */
    CCP_IOREG_gc = (0xD8<<0),  /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CTE - CTE Module
--------------------------------------------------------------------------
*/

/* CTM Module */
typedef struct CTEMS_struct
{
    register8_t reserved_1[4];
    register8_t MSCRA;  /* Micro Sequencer Control Register A */
    register8_t MSCRB;  /* Micro Sequencer Control Register B */
    register8_t MSSRACLR;  /* Micro Sequencer Status Register A Clear */
    register8_t MSSRASET;  /* Micro Sequencer Status Register A Set */
    register8_t MS0SRB;  /* Micro Sequencer Status Register B */
    register8_t MSSRC;  /* Micro Sequencer Status Register C */
    register8_t reserved_2[1];
    register8_t MSCCR;  /* Micro Sequencer Condition Code Register */
    register8_t reserved_3[2];
    _WORDREGISTER(MSLRR);  /* MS Link/Repeat Register */
    _WORDREGISTER(MSPC);  /* MS Program Counter */
    register8_t MSHIF;  /* MS Host Interface */
    register8_t reserved_4[1];
    register8_t MSIR0;  /* MS Instruction Register 0 */
    register8_t MSIR1;  /* MS Instruction Register 1 */
    register8_t MSIR2;  /* MS Instruction Register 2 */
    register8_t MSIR3;  /* MS Instruction Register 3 */
    _WORDREGISTER(MSIRBUF);  /* MS Instruction Register Buffer */
    _WORDREGISTER(MSR0);  /* MS R0 in register file */
    register8_t reserved_5[4];
} CTEMS_t;


/* CTE Module */
typedef struct CTE_struct
{
    register8_t ADCCRA;  /* ADC Control Register A */
    register8_t ADCCRB;  /* ADC Control Register B */
    register8_t ADCYCHR;  /* ADC Y-Channel Register */
    register8_t ADCINTCAL;  /* ADC and Integrator Calibration Register */
    register8_t ADCSRACLR;  /* ADC Status Register A Clear */
    register8_t ADCSRASET;  /* ADC Status Register A Set */
    register8_t ADCRES;  /* ADC Result */
    register8_t ADCINTTEST;  /* ADC and Integrator Test Register */
    register8_t ADCSHVBCAL;  /* ADC and S/H VBias Calibration Register */
    register8_t INTCRA;  /* Integrator Control Register A */
    register8_t INTCRBCLR;  /* Integrator Control Register B Clear */
    register8_t INTCRBSET;  /* Integrator Control Register B Set */
    register8_t INTFLAGSR;  /* Integrator Flags Register */
    register8_t INTXCHR;  /* Integrator X-Channel Register */
    register8_t INTEN;  /* Integrator Enable Register */
    register8_t reserved_1[1];
    register8_t INTOE;  /* Integrator Output Enable Register */
    register8_t INTMASKEN;  /* Integrator Mask Enable Register */
    register8_t reserved_2[1];
    register8_t SHEN;  /* S/H Enable Register */
    register8_t BIASCR;  /* Bias Control Register */
    register8_t TIMAPER;  /* Timer A Period Register */
    register8_t TIMBPER;  /* Timer B Period Register */
    register8_t TIMCPER;  /* Timer C Period Register */
    register8_t TIMMOEPER;  /* Integrator Master Output Enable Timer Period Register */
    register8_t TIMRSTPER;  /* Integrator Reset Timer Period Register */
    register8_t INTTRIG;  /* Integrator Trigger Register */
    register8_t INTDONE;  /* Integrator Done Register */
    register8_t INTGAIN0;  /* Integrator Gain 0 */
    register8_t INTGAIN1;  /* Integrator Gain 1 */
    register8_t INTGAIN2;  /* Integrator Gain 2 */
    register8_t INTGAIN3;  /* Integrator Gain 3 */
    register8_t PIFILA;  /* Port Interface Interleave Register A */
    register8_t PIFILB;  /* Port Interface Interleave Register B */
    register8_t PIFILE;  /* Port Interface Interleave Register Even */
    register8_t PIFILO;  /* Port Interface Interleave Register Odd */
    register8_t PIFXEN;  /* Port Interface X-line Enable */
    register8_t PIFYEN;  /* Port Interface Y-line Enable */
    register8_t PIFXSRL;  /* Port Interface X-line Slew-Rate Limitation */
    register8_t PIFYSRL;  /* Port Interface Y-line Slew-Rate Limitation */
    register8_t PIFXPORT;  /* Port Interface X-lines PORT */
    register8_t PIFYPORT;  /* Port Interface Y-lines PORT */
    register8_t PIFXDDR;  /* Port Interface X-lines DDR */
    register8_t PIFYDDR;  /* Port Interface Y-lines DDR */
    register8_t PIFXPIN;  /* Port Interface X-lines PIN */
    register8_t PIFYPIN;  /* Port Interface Y-lines PIN */
    register8_t PIFXTGL;  /* Port Interface X-lines Toggle */
    register8_t PIFYTGL;  /* Port Interface Y-lines Toggle */
    register8_t GCAFCRA;  /* GCAF Control Register A */
    register8_t GCAFCRB;  /* GCAF Control Register B */
    register8_t GCAFSRA;  /* GCAF Status Register A */
    register8_t GCAFBASELIM;  /* GCAF Base Address and Grass Cut Limit */
    register8_t CTTEMP;  /* CapTouch Temporary Register */
    register8_t CTCRA;  /* CapTouch Control Register A */
    register8_t reserved_3[10];
    CTEMS_t MS0;  /* Micro sequencer 0 control registers */
    CTEMS_t MS1;  /* Micro sequencer 1 control registers */
} CTE_t;

/* Arbiter mode */
typedef enum CTE_CTEMS_MSAM_enum
{
    CTE_CTEMS_MSAM_AM1_gc = (0x00<<1),  /* Not yet implemented */
    CTE_CTEMS_MSAM_AM2_gc = (0x01<<1),  /* Not yet implemented */
    CTE_CTEMS_MSAM_AM3_gc = (0x02<<1),  /* Not yet implemented */
    CTE_CTEMS_MSAM_AM4_gc = (0x03<<1),  /* Reserved */
} CTE_CTEMS_MSAM_t;

/* Interrupt Level */
typedef enum CTE_CTEMS_MSIL_enum
{
    CTE_CTEMS_MSIL_DIS_gc = (0x00<<3),  /* Disabled */
    CTE_CTEMS_MSIL_LOW_gc = (0x01<<3),  /* Low priority */
    CTE_CTEMS_MSIL_MED_gc = (0x02<<3),  /* Medium priority */
    CTE_CTEMS_MSIL_HI_gc = (0x03<<3),  /* High priority */
} CTE_CTEMS_MSIL_t;

/* Timer/Counter Clock Source */
typedef enum CTE_CTEMS_MSTCCS_enum
{
    CTE_CTEMS_MSTCCS_OFF_gc = (0x00<<0),  /* OFF */
    CTE_CTEMS_MSTCCS_OSC_gc = (0x01<<0),  /* f_osc */
    CTE_CTEMS_MSTCCS_EV0_gc = (0x02<<0),  /* Event uSequencer 0 */
    CTE_CTEMS_MSTCCS_EV1_gc = (0x03<<0),  /* Event uSequencer 1 */
} CTE_CTEMS_MSTCCS_t;

/* ADC Reference Voltage */
typedef enum CTE_ADCREFSEL_enum
{
    CTE_ADCREFSEL_1BGR_gc = (0x00<<6),  /* 1V Bandgap Reference */
    CTE_ADCREFSEL_46AV_gc = (0x01<<6),  /* 0.46 * AVcc */
    CTE_ADCREFSEL_50AV_gc = (0x02<<6),  /* 0.50 * AVcc */
    CTE_ADCREFSEL_66AV_gc = (0x03<<6),  /* 0.66 * AVcc */
} CTE_ADCREFSEL_t;

/* Maximum ADC speed */
typedef enum CTE_ADCSPEED_enum
{
    CTE_ADCSPEED_1MPS_gc = (0x00<<0),  /* 1 Msps */
    CTE_ADCSPEED_2MPS_gc = (0x01<<0),  /* 2 Msps */
    CTE_ADCSPEED_3MPS_gc = (0x02<<0),  /* 3 Msps */
    CTE_ADCSPEED_4MPS_gc = (0x03<<0),  /* 4 Msps */
} CTE_ADCSPEED_t;

