gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/* ADC Startup Mode */
typedef enum CTE_ADCSUM_enum
{
    CTE_ADCSUM_ADC1_gc = (0x00<<7),  /* S/H started before ADC to minimize peak current */
    CTE_ADCSUM_ADC2_gc = (0x01<<7),  /* S/H and ADC started in parallel to minimize startup time */
} CTE_ADCSUM_t;

/* GCAF Average Filter Accumulator Mode */
typedef enum CTE_GCAFACCM_enum
{
    CTE_GCAFACCM_DIS_gc = (0x00<<6),  /* Disabled */
    CTE_GCAFACCM_RES_gc = (0x01<<6),  /* Reserved */
    CTE_GCAFACCM_ACC_gc = (0x02<<6),  /* Accumulate always */
    CTE_GCAFACCM_LIM_gc = (0x03<<6),  /* Accumulate only samples which are within the given limits */
} CTE_GCAFACCM_t;

/* GCAF Addressing Mode */
typedef enum CTE_GCAFAM_enum
{
    CTE_GCAFAM_NORM_gc = (0x00<<5),  /* Normal */
    CTE_GCAFAM_XFLIP_gc = (0x01<<5),  /* X flip */
    CTE_GCAFAM_YFLIP_gc = (0x02<<5),  /* Y flip */
    CTE_GCAFAM_XYFLIP_gc = (0x03<<5),  /* X and Y flip */
    CTE_GCAFAM_TRANS_gc = (0x04<<5),  /* Transpose */
    CTE_GCAFAM_XTRANS_gc = (0x05<<5),  /* X flip and transpose */
    CTE_GCAFAM_YTRANS_gc = (0x06<<5),  /* Y flip and transpose */
    CTE_GCAFAM_XYTRANS_gc = (0x07<<5),  /* X and Y flip and transpose */
} CTE_GCAFAM_t;

/* GCAF Median Filter Mode */
typedef enum CTE_GCAFMEDM_enum
{
    CTE_GCAFMEDM_DIS_gc = (0x00<<1),  /* Disabled */
    CTE_GCAFMEDM_MED3_gc = (0x01<<1),  /* Median of 3 samples */
    CTE_GCAFMEDM_MED4P_gc = (0x02<<1),  /* Median of 4 samples and previous median */
    CTE_GCAFMEDM_MED5_gc = (0x03<<1),  /* Median of 5 samples */
    CTE_GCAFMEDM_MED4A_gc = (0x04<<1),  /* Median of 4 samples. Average of two mid samples of four sorted samples. */
    CTE_GCAFMEDM_RES1_gc = (0x05<<1),  /* Reserved1 */
    CTE_GCAFMEDM_RES2_gc = (0x06<<1),  /* Reserved2 */
    CTE_GCAFMEDM_RES3_gc = (0x07<<1),  /* Reserved3 */
} CTE_GCAFMEDM_t;

/* Integrator Gain */
typedef enum CTE_INT0GAIN_enum
{
    CTE_INT0GAIN_INT1_gc = (0x00<<0),  /* 1/8 */
    CTE_INT0GAIN_INT2_gc = (0x01<<0),  /* 2/8 */
    CTE_INT0GAIN_INT3_gc = (0x02<<0),  /* 3/8 */
    CTE_INT0GAIN_INT4_gc = (0x03<<0),  /* 4/8 */
    CTE_INT0GAIN_INT5_gc = (0x04<<0),  /* 5/8 */
    CTE_INT0GAIN_INT6_gc = (0x05<<0),  /* 6/8 */
    CTE_INT0GAIN_INT7_gc = (0x06<<0),  /* 7/8 */
    CTE_INT0GAIN_INT8_gc = (0x07<<0),  /* 8/8 */
} CTE_INT0GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT12GAIN_enum
{
    CTE_INT12GAIN_INT1_gc = (0x00<<0),  /* 1/8 */
    CTE_INT12GAIN_INT2_gc = (0x01<<0),  /* 2/8 */
    CTE_INT12GAIN_INT3_gc = (0x02<<0),  /* 3/8 */
    CTE_INT12GAIN_INT4_gc = (0x03<<0),  /* 4/8 */
    CTE_INT12GAIN_INT5_gc = (0x04<<0),  /* 5/8 */
    CTE_INT12GAIN_INT6_gc = (0x05<<0),  /* 6/8 */
    CTE_INT12GAIN_INT7_gc = (0x06<<0),  /* 7/8 */
    CTE_INT12GAIN_INT8_gc = (0x07<<0),  /* 8/8 */
} CTE_INT12GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT13GAIN_enum
{
    CTE_INT13GAIN_INT1_gc = (0x00<<4),  /* 1/8 */
    CTE_INT13GAIN_INT2_gc = (0x01<<4),  /* 2/8 */
    CTE_INT13GAIN_INT3_gc = (0x02<<4),  /* 3/8 */
    CTE_INT13GAIN_INT4_gc = (0x03<<4),  /* 4/8 */
    CTE_INT13GAIN_INT5_gc = (0x04<<4),  /* 5/8 */
    CTE_INT13GAIN_INT6_gc = (0x05<<4),  /* 6/8 */
    CTE_INT13GAIN_INT7_gc = (0x06<<4),  /* 7/8 */
    CTE_INT13GAIN_INT8_gc = (0x07<<4),  /* 8/8 */
} CTE_INT13GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT1GAIN_enum
{
    CTE_INT1GAIN_INT1_gc = (0x00<<4),  /* 1/8 */
    CTE_INT1GAIN_INT2_gc = (0x01<<4),  /* 2/8 */
    CTE_INT1GAIN_INT3_gc = (0x02<<4),  /* 3/8 */
    CTE_INT1GAIN_INT4_gc = (0x03<<4),  /* 4/8 */
    CTE_INT1GAIN_INT5_gc = (0x04<<4),  /* 5/8 */
    CTE_INT1GAIN_INT6_gc = (0x05<<4),  /* 6/8 */
    CTE_INT1GAIN_INT7_gc = (0x06<<4),  /* 7/8 */
    CTE_INT1GAIN_INT8_gc = (0x07<<4),  /* 8/8 */
} CTE_INT1GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT4GAIN_enum
{
    CTE_INT4GAIN_INT1_gc = (0x00<<0),  /* 1/8 */
    CTE_INT4GAIN_INT2_gc = (0x01<<0),  /* 2/8 */
    CTE_INT4GAIN_INT3_gc = (0x02<<0),  /* 3/8 */
    CTE_INT4GAIN_INT4_gc = (0x03<<0),  /* 4/8 */
    CTE_INT4GAIN_INT5_gc = (0x04<<0),  /* 5/8 */
    CTE_INT4GAIN_INT6_gc = (0x05<<0),  /* 6/8 */
    CTE_INT4GAIN_INT7_gc = (0x06<<0),  /* 7/8 */
    CTE_INT4GAIN_INT8_gc = (0x07<<0),  /* 8/8 */
} CTE_INT4GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT5GAIN_enum
{
    CTE_INT5GAIN_INT1_gc = (0x00<<4),  /* 1/8 */
    CTE_INT5GAIN_INT2_gc = (0x01<<4),  /* 2/8 */
    CTE_INT5GAIN_INT3_gc = (0x02<<4),  /* 3/8 */
    CTE_INT5GAIN_INT4_gc = (0x03<<4),  /* 4/8 */
    CTE_INT5GAIN_INT5_gc = (0x04<<4),  /* 5/8 */
    CTE_INT5GAIN_INT6_gc = (0x05<<4),  /* 6/8 */
    CTE_INT5GAIN_INT7_gc = (0x06<<4),  /* 7/8 */
    CTE_INT5GAIN_INT8_gc = (0x07<<4),  /* 8/8 */
} CTE_INT5GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT8GAIN_enum
{
    CTE_INT8GAIN_INT1_gc = (0x00<<0),  /* 1/8 */
    CTE_INT8GAIN_INT2_gc = (0x01<<0),  /* 2/8 */
    CTE_INT8GAIN_INT3_gc = (0x02<<0),  /* 3/8 */
    CTE_INT8GAIN_INT4_gc = (0x03<<0),  /* 4/8 */
    CTE_INT8GAIN_INT5_gc = (0x04<<0),  /* 5/8 */
    CTE_INT8GAIN_INT6_gc = (0x05<<0),  /* 6/8 */
    CTE_INT8GAIN_INT7_gc = (0x06<<0),  /* 7/8 */
    CTE_INT8GAIN_INT8_gc = (0x07<<0),  /* 8/8 */
} CTE_INT8GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT9GAIN_enum
{
    CTE_INT9GAIN_INT1_gc = (0x00<<4),  /* 1/8 */
    CTE_INT9GAIN_INT2_gc = (0x01<<4),  /* 2/8 */
    CTE_INT9GAIN_INT3_gc = (0x02<<4),  /* 3/8 */
    CTE_INT9GAIN_INT4_gc = (0x03<<4),  /* 4/8 */
    CTE_INT9GAIN_INT5_gc = (0x04<<4),  /* 5/8 */
    CTE_INT9GAIN_INT6_gc = (0x05<<4),  /* 6/8 */
    CTE_INT9GAIN_INT7_gc = (0x06<<4),  /* 7/8 */
    CTE_INT9GAIN_INT8_gc = (0x07<<4),  /* 8/8 */
} CTE_INT9GAIN_t;

/* Integrator Reset Level */
typedef enum CTE_INTRSTLVL_enum
{
    CTE_INTRSTLVL_16AV_gc = (0x00<<3),  /* 0.16 * AVdd */
    CTE_INTRSTLVL_18AV_gc = (0x01<<3),  /* 0.18 * AVdd */
    CTE_INTRSTLVL_20AV_gc = (0x02<<3),  /* 0.20 * AVdd */
    CTE_INTRSTLVL_24AV_gc = (0x03<<3),  /* 0.24 * AVdd */
    CTE_INTRSTLVL_32AV_gc = (0x04<<3),  /* 0.32 * AVdd */
    CTE_INTRSTLVL_50AV_gc = (0x05<<3),  /* 0.50 * AVdd */
    CTE_INTRSTLVL_ILL1_gc = (0x06<<3),  /* Illegal setting1 */
    CTE_INTRSTLVL_ILL2_gc = (0x07<<3),  /* Illegal setting2 */
} CTE_INTRSTLVL_t;

