gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/*
--------------------------------------------------------------------------
DFLL - DFLL
--------------------------------------------------------------------------
*/

/* DFLL */
typedef struct DFLL_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[1];
    register8_t CALA;  /* Calibration Register A */
    register8_t CALB;  /* Calibration Register B */
    register8_t COMP0;  /* Oscillator Compare Register 0 */
    register8_t COMP1;  /* Oscillator Compare Register 1 */
    register8_t COMP2;  /* Oscillator Compare Register 2 */
    register8_t reserved_2[1];
} DFLL_t;


/*
--------------------------------------------------------------------------
MCU - MCU Control
--------------------------------------------------------------------------
*/

/* MCU Control */
typedef struct MCU_struct
{
    register8_t DEVID0;  /* Device ID byte 0 */
    register8_t DEVID1;  /* Device ID byte 1 */
    register8_t DEVID2;  /* Device ID byte 2 */
    register8_t REVID;  /* Revision ID */
    register8_t JTAGUID;  /* JTAG User ID */
    register8_t reserved_1[1];
    register8_t MCUCR;  /* MCU Control */
    register8_t reserved_2[1];
    register8_t EVSYSLOCK;  /* Event System Lock */
    register8_t AWEXLOCK;  /* AWEX Lock */
    register8_t reserved_3[2];
} MCU_t;


/*
--------------------------------------------------------------------------
NVM - Non Volatile Memory Controller
--------------------------------------------------------------------------
*/

/* Non-volatile Memory Controller */
typedef struct NVM_struct
{
    register8_t ADDR0;  /* Address Register 0 */
    register8_t ADDR1;  /* Address Register 1 */
    register8_t ADDR2;  /* Address Register 2 */
    register8_t reserved_1[1];
    register8_t DATA0;  /* Data Register 0 */
    register8_t DATA1;  /* Data Register 1 */
    register8_t DATA2;  /* Data Register 2 */
    register8_t reserved_2[3];
    register8_t CMD;  /* Command */
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t reserved_3[1];
    register8_t STATUS;  /* Status */
    register8_t LOCK_BITS;  /* Lock Bits (Changed from LOCKBITS to avoid avr-libc collision) */
} NVM_t;


/* Lock Bits */
typedef struct NVM_LOCKBITS_struct
{
    register8_t LOCK_BITS;  /* Lock Bits (Changed from LOCKBITS to avoid avr-libc collision) */
} NVM_LOCKBITS_t;


/* Fuses */
typedef struct NVM_FUSES_struct
{
    register8_t reserved_1[4];
    register8_t FUSEBYTE4;  /* Start-up Configuration */
    register8_t FUSEBYTE5;  /* BOD Level */
} NVM_FUSES_t;


/* Production Signatures */
typedef struct NVM_PROD_SIGNATURES_struct
{
    register8_t RC24MCALB;  /* RCOSC 24MHz Calibration Value B */
    register8_t RC24MCALA;  /* RCOSC 24MHz Calibration Value A */
    register8_t FUSEBYTE1;  /* Fuse Byte 1 Value */
    register8_t reserved_1[1];
    register8_t RC32K;  /* RC 32kHz Calibration Value */
    register8_t ULP32K;  /* ULP 32kHz Calibration Value */
    register8_t FUSEBYTE2;  /* Fuse Byte 2 Value */
    register8_t reserved_2[27];
    register8_t ADCAOFFL;  /* ADCA Offset Low Byte */
    register8_t ADCAOFFH;  /* ADCA Offset High Byte */
    register8_t reserved_3[2];
    register8_t ADCBOFFL;  /* ADCB Offset Low Byte */
    register8_t ADCBOFFH;  /* ADCB Offset High Byte */
    register8_t reserved_4[16];
    register8_t BOD0;  /* BOD Bandgap Calibration Byte 0 */
    register8_t BOD1;  /* BOD Bandgap Calibration Byte 1 */
    register8_t BOD2;  /* BOD Bandgap Calibration Byte 2 */
    register8_t reserved_5[1];
    register8_t XLINE_BIAS_350_H;  /* X-line Bias Calibration 350 High */
    register8_t XLINE_BIAS_350_L;  /* X-line Bias Calibration 350 Low */
    register8_t XLINE_BIAS_400_H;  /* X-line Bias Calibration 400 High */
    register8_t XLINE_BIAS_400_L;  /* X-line Bias Calibration 400 Low */
    register8_t XLINE_BIAS_500_H;  /* X-line Bias Calibration 500 High */
    register8_t XLINE_BIAS_500_L;  /* X-line Bias Calibration 500 Low */
    register8_t YLINE_INT_BIAS;  /* Y-line Integrator Bias */
    register8_t YLINEINT_CAP;  /* Y-line Integrator Capacitor */
    register8_t reserved_6[1];
    register8_t ADCSHVBCALH;  /* ADCSHVBCALH */
    register8_t ADCSHVBCALL;  /* ADCSHVBCALL */
    register8_t reserved_7[101];
    register8_t BGEXTREME0_WS;  /* Bandgap Extreme Value 0 (Cal 0x42) */
    register8_t BGEXTREME1_WS;  /* Bandgap Extreme Value 1 (Cal 0x45) */
    register8_t BGEXTREME2_WS;  /* Bandgap Extreme Value 2 (Cal 0x3A) */
    register8_t BGEXTREME3_WS;  /* Bandgap Extreme Value 3 (Cal 0x3D) */
} NVM_PROD_SIGNATURES_t;


/* User Signature */
typedef struct NVM_USER_SIGNATURES_struct
{
    register8_t CTM_SYS_OFF_VER_85C;  /* Version of Algorithm for Systematical Offset Calibration Calculation at 85 */
    register8_t CTM_SYS_OFF_VER_25C;  /* Version of Algorithm for Systematical Offset Calibration Calculation at 25 */
    register8_t reserved_1[5];
    register8_t CTM_SYS_CALOFF_00;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_01;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_02;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_03;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_04;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_05;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_06;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_07;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_08;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_09;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_10;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_11;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_12;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_13;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_14;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_15;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_16;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_17;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_18;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_19;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_20;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_21;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_22;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_23;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_24;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_25;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_26;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_27;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_28;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_29;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_30;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t CTM_SYS_CALOFF_31;  /* Systematic Offset Calibration Step Size at Gain 0 at 85C */
    register8_t reserved_2[2];
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_00;  /* Systematic Input Offset for Gain 0 for Channel 0 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_01;  /* Systematic Input Offset for Gain 0 for Channel 1 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_02;  /* Systematic Input Offset for Gain 0 for Channel 2 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_03;  /* Systematic Input Offset for Gain 0 for Channel 3 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_04;  /* Systematic Input Offset for Gain 0 for Channel 4 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_05;  /* Systematic Input Offset for Gain 0 for Channel 5 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_06;  /* Systematic Input Offset for Gain 0 for Channel 6 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_07;  /* Systematic Input Offset for Gain 0 for Channel 7 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_08;  /* Systematic Input Offset for Gain 0 for Channel 8 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_09;  /* Systematic Input Offset for Gain 0 for Channel 9 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_10;  /* Systematic Input Offset for Gain 0 for Channel 10 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_11;  /* Systematic Input Offset for Gain 0 for Channel 11 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_12;  /* Systematic Input Offset for Gain 0 for Channel 12 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_00_CH_13;  /* Systematic Input Offset for Gain 0 for Channel 13 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_00;  /* Systematic Input Offset for Gain 1 for Channel 0 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_01;  /* Systematic Input Offset for Gain 1 for Channel 1 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_02;  /* Systematic Input Offset for Gain 1 for Channel 2 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_03;  /* Systematic Input Offset for Gain 1 for Channel 3 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_04;  /* Systematic Input Offset for Gain 1 for Channel 4 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_05;  /* Systematic Input Offset for Gain 1 for Channel 5 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_06;  /* Systematic Input Offset for Gain 1 for Channel 6 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_07;  /* Systematic Input Offset for Gain 1 for Channel 7 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_08;  /* Systematic Input Offset for Gain 1 for Channel 8 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_09;  /* Systematic Input Offset for Gain 1 for Channel 9 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_10;  /* Systematic Input Offset for Gain 1 for Channel 10 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_11;  /* Systematic Input Offset for Gain 1 for Channel 11 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_12;  /* Systematic Input Offset for Gain 1 for Channel 12 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_01_CH_13;  /* Systematic Input Offset for Gain 1 for Channel 13 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_00;  /* Systematic Input Offset for Gain 2 for Channel 0 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_01;  /* Systematic Input Offset for Gain 2 for Channel 1 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_02;  /* Systematic Input Offset for Gain 2 for Channel 2 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_03;  /* Systematic Input Offset for Gain 2 for Channel 3 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_04;  /* Systematic Input Offset for Gain 2 for Channel 4 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_05;  /* Systematic Input Offset for Gain 2 for Channel 5 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_06;  /* Systematic Input Offset for Gain 2 for Channel 6 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_07;  /* Systematic Input Offset for Gain 2 for Channel 7 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_08;  /* Systematic Input Offset for Gain 2 for Channel 8 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_09;  /* Systematic Input Offset for Gain 2 for Channel 9 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_10;  /* Systematic Input Offset for Gain 2 for Channel 10 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_11;  /* Systematic Input Offset for Gain 2 for Channel 11 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_12;  /* Systematic Input Offset for Gain 2 for Channel 12 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_02_CH_13;  /* Systematic Input Offset for Gain 2 for Channel 13 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_00;  /* Systematic Input Offset for Gain 3 for Channel 0 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_01;  /* Systematic Input Offset for Gain 3 for Channel 1 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_02;  /* Systematic Input Offset for Gain 3 for Channel 2 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_03;  /* Systematic Input Offset for Gain 3 for Channel 3 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_04;  /* Systematic Input Offset for Gain 3 for Channel 4 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_05;  /* Systematic Input Offset for Gain 3 for Channel 5 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_06;  /* Systematic Input Offset for Gain 3 for Channel 6 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_07;  /* Systematic Input Offset for Gain 3 for Channel 7 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_08;  /* Systematic Input Offset for Gain 3 for Channel 8 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_09;  /* Systematic Input Offset for Gain 3 for Channel 9 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_10;  /* Systematic Input Offset for Gain 3 for Channel 10 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_11;  /* Systematic Input Offset for Gain 3 for Channel 11 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_12;  /* Systematic Input Offset for Gain 3 for Channel 12 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_03_CH_13;  /* Systematic Input Offset for Gain 3 for Channel 13 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_00;  /* Systematic Input Offset for Gain 4 for Channel 0 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_01;  /* Systematic Input Offset for Gain 4 for Channel 1 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_02;  /* Systematic Input Offset for Gain 4 for Channel 2 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_03;  /* Systematic Input Offset for Gain 4 for Channel 3 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_04;  /* Systematic Input Offset for Gain 4 for Channel 4 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_05;  /* Systematic Input Offset for Gain 4 for Channel 5 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_06;  /* Systematic Input Offset for Gain 4 for Channel 6 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_07;  /* Systematic Input Offset for Gain 4 for Channel 7 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_08;  /* Systematic Input Offset for Gain 4 for Channel 8 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_09;  /* Systematic Input Offset for Gain 4 for Channel 9 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_10;  /* Systematic Input Offset for Gain 4 for Channel 10 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_11;  /* Systematic Input Offset for Gain 4 for Channel 11 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_12;  /* Systematic Input Offset for Gain 4 for Channel 12 at 85 */
    register8_t CTM_SYS_INPOFF_85C_G_04_CH_13;  /* Systematic Input Offset for Gain 4 for Channel 13 at 85 */
    register8_t reserved_3[28];
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_00;  /* Systematic Input Offset for Gain 0 for Channel 0 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_01;  /* Systematic Input Offset for Gain 0 for Channel 1 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_02;  /* Systematic Input Offset for Gain 0 for Channel 2 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_03;  /* Systematic Input Offset for Gain 0 for Channel 3 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_04;  /* Systematic Input Offset for Gain 0 for Channel 4 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_05;  /* Systematic Input Offset for Gain 0 for Channel 5 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_06;  /* Systematic Input Offset for Gain 0 for Channel 6 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_07;  /* Systematic Input Offset for Gain 0 for Channel 7 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_08;  /* Systematic Input Offset for Gain 0 for Channel 8 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_09;  /* Systematic Input Offset for Gain 0 for Channel 9 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_10;  /* Systematic Input Offset for Gain 0 for Channel 10 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_11;  /* Systematic Input Offset for Gain 0 for Channel 11 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_12;  /* Systematic Input Offset for Gain 0 for Channel 12 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_00_CH_13;  /* Systematic Input Offset for Gain 0 for Channel 13 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_00;  /* Systematic Input Offset for Gain 1 for Channel 0 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_01;  /* Systematic Input Offset for Gain 1 for Channel 1 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_02;  /* Systematic Input Offset for Gain 1 for Channel 2 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_03;  /* Systematic Input Offset for Gain 1 for Channel 3 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_04;  /* Systematic Input Offset for Gain 1 for Channel 4 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_05;  /* Systematic Input Offset for Gain 1 for Channel 5 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_06;  /* Systematic Input Offset for Gain 1 for Channel 6 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_07;  /* Systematic Input Offset for Gain 1 for Channel 7 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_08;  /* Systematic Input Offset for Gain 1 for Channel 8 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_09;  /* Systematic Input Offset for Gain 1 for Channel 9 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_10;  /* Systematic Input Offset for Gain 1 for Channel 10 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_11;  /* Systematic Input Offset for Gain 1 for Channel 11 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_12;  /* Systematic Input Offset for Gain 1 for Channel 12 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_01_CH_13;  /* Systematic Input Offset for Gain 1 for Channel 13 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_00;  /* Systematic Input Offset for Gain 2 for Channel 0 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_01;  /* Systematic Input Offset for Gain 2 for Channel 1 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_02;  /* Systematic Input Offset for Gain 2 for Channel 2 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_03;  /* Systematic Input Offset for Gain 2 for Channel 3 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_04;  /* Systematic Input Offset for Gain 2 for Channel 4 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_05;  /* Systematic Input Offset for Gain 2 for Channel 5 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_06;  /* Systematic Input Offset for Gain 2 for Channel 6 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_07;  /* Systematic Input Offset for Gain 2 for Channel 7 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_08;  /* Systematic Input Offset for Gain 2 for Channel 8 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_09;  /* Systematic Input Offset for Gain 2 for Channel 9 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_10;  /* Systematic Input Offset for Gain 2 for Channel 10 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_11;  /* Systematic Input Offset for Gain 2 for Channel 11 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_12;  /* Systematic Input Offset for Gain 2 for Channel 12 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_02_CH_13;  /* Systematic Input Offset for Gain 2 for Channel 13 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_00;  /* Systematic Input Offset for Gain 3 for Channel 0 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_01;  /* Systematic Input Offset for Gain 3 for Channel 1 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_02;  /* Systematic Input Offset for Gain 3 for Channel 2 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_03;  /* Systematic Input Offset for Gain 3 for Channel 3 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_04;  /* Systematic Input Offset for Gain 3 for Channel 4 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_05;  /* Systematic Input Offset for Gain 3 for Channel 5 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_06;  /* Systematic Input Offset for Gain 3 for Channel 6 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_07;  /* Systematic Input Offset for Gain 3 for Channel 7 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_08;  /* Systematic Input Offset for Gain 3 for Channel 8 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_09;  /* Systematic Input Offset for Gain 3 for Channel 9 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_10;  /* Systematic Input Offset for Gain 3 for Channel 10 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_11;  /* Systematic Input Offset for Gain 3 for Channel 11 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_12;  /* Systematic Input Offset for Gain 3 for Channel 12 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_03_CH_13;  /* Systematic Input Offset for Gain 3 for Channel 13 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_00;  /* Systematic Input Offset for Gain 4 for Channel 0 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_01;  /* Systematic Input Offset for Gain 4 for Channel 1 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_02;  /* Systematic Input Offset for Gain 4 for Channel 2 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_03;  /* Systematic Input Offset for Gain 4 for Channel 3 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_04;  /* Systematic Input Offset for Gain 4 for Channel 4 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_05;  /* Systematic Input Offset for Gain 4 for Channel 5 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_06;  /* Systematic Input Offset for Gain 4 for Channel 6 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_07;  /* Systematic Input Offset for Gain 4 for Channel 7 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_08;  /* Systematic Input Offset for Gain 4 for Channel 8 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_09;  /* Systematic Input Offset for Gain 4 for Channel 9 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_10;  /* Systematic Input Offset for Gain 4 for Channel 10 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_11;  /* Systematic Input Offset for Gain 4 for Channel 11 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_12;  /* Systematic Input Offset for Gain 4 for Channel 12 at 25 */
    register8_t CTM_SYS_INPOFF_25C_G_04_CH_13;  /* Systematic Input Offset for Gain 4 for Channel 13 at 25 */
} NVM_USER_SIGNATURES_t;

/* Boot lock bits - application section */
typedef enum NVM_BLBA_enum
{
    NVM_BLBA_RWLOCK_gc = (0x00<<4),  /* Read and write not allowed */
    NVM_BLBA_RLOCK_gc = (0x01<<4),  /* Read not allowed */
    NVM_BLBA_WLOCK_gc = (0x02<<4),  /* Write not allowed */
    NVM_BLBA_NOLOCK_gc = (0x03<<4),  /* No locks */
} NVM_BLBA_t;

