gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/*
==========================================================================
IO Module Instances. Mapped to memory.
==========================================================================
*/

#define VPORT0              (*(VPORT_t *) 0x0010) /* Virtual Port */
#define VPORT1              (*(VPORT_t *) 0x0014) /* Virtual Port */
#define VPORT2              (*(VPORT_t *) 0x0018) /* Virtual Port */
#define VPORT3              (*(VPORT_t *) 0x001C) /* Virtual Port */
#define OCD                   (*(OCD_t *) 0x002E) /* On-Chip Debug System */
#define CLK                   (*(CLK_t *) 0x0040) /* Clock System */
#define SLEEP               (*(SLEEP_t *) 0x0048) /* Sleep Controller */
#define OSC                   (*(OSC_t *) 0x0050) /* Oscillator */
#define DFLLRC32M            (*(DFLL_t *) 0x0060) /* DFLL */
#define PR                     (*(PR_t *) 0x0070) /* Power Reduction */
#define RST                   (*(RST_t *) 0x0078) /* Reset */
#define WDT                   (*(WDT_t *) 0x0080) /* Watch-Dog Timer */
#define MCU                   (*(MCU_t *) 0x0090) /* MCU Control */
#define PMIC                 (*(PMIC_t *) 0x00A0) /* Programmable Multi-level Interrupt Controller */
#define PORTCFG           (*(PORTCFG_t *) 0x00B0) /* I/O port Configuration */
#define NVM                   (*(NVM_t *) 0x01C0) /* Non-volatile Memory Controller */
#define PWR                   (*(PWR_t *) 0x01F0) /* Power Control */
#define RTC                   (*(RTC_t *) 0x0400) /* Real-Time Counter */
#define TWIC                  (*(TWI_t *) 0x0480) /* Two-Wire Interface */
#define PORTC                (*(PORT_t *) 0x0640) /* I/O Ports */
#define PORTH              (*(PORT_T_t *) 0x06E0) /* I/O Ports, disableable */
#define PORTJ              (*(PORT_T_t *) 0x0700) /* I/O Ports, disableable */
#define PORTK              (*(PORT_T_t *) 0x0720) /* I/O Ports, disableable */
#define PORTL              (*(PORT_T_t *) 0x0740) /* I/O Ports, disableable */
#define TCC0                  (*(TC0_t *) 0x0800) /* 16-bit Timer/Counter 0 */
#define TCC1                  (*(TC1_t *) 0x0840) /* 16-bit Timer/Counter 1 */
#define USARTC0             (*(USART_t *) 0x08A0) /* Universal Synchronous/Asynchronous Receiver/Transmitter */
#define SPIC                  (*(SPI_t *) 0x08C0) /* Serial Peripheral Interface */
#define CTE                   (*(CTE_t *) 0x0C00) /* CTE Module */

#endif /* !defined (__ASSEMBLER__) */


/* ========== Flattened fully qualified IO register names ========== */


/* GPIO - General Purpose IO Registers */
#define GPIO_GPIOR  _SFR_MEM8(0x0000)


/* Deprecated */
#define GPIO_GPIO  _SFR_MEM8(0x0000)


/* NVM_FUSES (FUSE) - Fuses */
#define FUSE_FUSEBYTE4  _SFR_MEM8(0x0004)
#define FUSE_FUSEBYTE5  _SFR_MEM8(0x0005)


/* NVM_LOCKBITS (LOCKBIT) - Lock Bits */
#define LOCKBIT_LOCKBITS  _SFR_MEM8(0x0000)


/* NVM_PROD_SIGNATURES (PROD_SIGNATURES) - Production Signatures */
#define PRODSIGNATURES_RC24MCALB  _SFR_MEM8(0x0000)
#define PRODSIGNATURES_RC24MCALA  _SFR_MEM8(0x0001)
#define PRODSIGNATURES_FUSEBYTE1  _SFR_MEM8(0x0002)
#define PRODSIGNATURES_RC32K  _SFR_MEM8(0x0004)
#define PRODSIGNATURES_ULP32K  _SFR_MEM8(0x0005)
#define PRODSIGNATURES_FUSEBYTE2  _SFR_MEM8(0x0006)
#define PRODSIGNATURES_ADCAOFFL  _SFR_MEM8(0x0022)
#define PRODSIGNATURES_ADCAOFFH  _SFR_MEM8(0x0023)
#define PRODSIGNATURES_ADCBOFFL  _SFR_MEM8(0x0026)
#define PRODSIGNATURES_ADCBOFFH  _SFR_MEM8(0x0027)
#define PRODSIGNATURES_BOD0  _SFR_MEM8(0x0038)
#define PRODSIGNATURES_BOD1  _SFR_MEM8(0x0039)
#define PRODSIGNATURES_BOD2  _SFR_MEM8(0x003A)
#define PRODSIGNATURES_XLINE_BIAS_350_H  _SFR_MEM8(0x003C)
#define PRODSIGNATURES_XLINE_BIAS_350_L  _SFR_MEM8(0x003D)
#define PRODSIGNATURES_XLINE_BIAS_400_H  _SFR_MEM8(0x003E)
#define PRODSIGNATURES_XLINE_BIAS_400_L  _SFR_MEM8(0x003F)
#define PRODSIGNATURES_XLINE_BIAS_500_H  _SFR_MEM8(0x0040)
#define PRODSIGNATURES_XLINE_BIAS_500_L  _SFR_MEM8(0x0041)
#define PRODSIGNATURES_YLINE_INT_BIAS  _SFR_MEM8(0x0042)
#define PRODSIGNATURES_YLINEINT_CAP  _SFR_MEM8(0x0043)
#define PRODSIGNATURES_ADCSHVBCALH  _SFR_MEM8(0x0045)
#define PRODSIGNATURES_ADCSHVBCALL  _SFR_MEM8(0x0046)
#define PRODSIGNATURES_BGEXTREME0_WS  _SFR_MEM8(0x00AC)
#define PRODSIGNATURES_BGEXTREME1_WS  _SFR_MEM8(0x00AD)
#define PRODSIGNATURES_BGEXTREME2_WS  _SFR_MEM8(0x00AE)
#define PRODSIGNATURES_BGEXTREME3_WS  _SFR_MEM8(0x00AF)


/* VPORT (VPORT0) - Virtual Port */
#define VPORT0_DIR  _SFR_MEM8(0x0010)
#define VPORT0_OUT  _SFR_MEM8(0x0011)
#define VPORT0_IN  _SFR_MEM8(0x0012)
#define VPORT0_INTFLAGS  _SFR_MEM8(0x0013)


/* VPORT (VPORT1) - Virtual Port */
#define VPORT1_DIR  _SFR_MEM8(0x0014)
#define VPORT1_OUT  _SFR_MEM8(0x0015)
#define VPORT1_IN  _SFR_MEM8(0x0016)
#define VPORT1_INTFLAGS  _SFR_MEM8(0x0017)


/* VPORT (VPORT2) - Virtual Port */
#define VPORT2_DIR  _SFR_MEM8(0x0018)
#define VPORT2_OUT  _SFR_MEM8(0x0019)
#define VPORT2_IN  _SFR_MEM8(0x001A)
#define VPORT2_INTFLAGS  _SFR_MEM8(0x001B)


/* VPORT (VPORT3) - Virtual Port */
#define VPORT3_DIR  _SFR_MEM8(0x001C)
#define VPORT3_OUT  _SFR_MEM8(0x001D)
#define VPORT3_IN  _SFR_MEM8(0x001E)
#define VPORT3_INTFLAGS  _SFR_MEM8(0x001F)


/* OCD - On-Chip Debug System */
#define OCD_OCDR0  _SFR_MEM8(0x002E)
#define OCD_OCDR1  _SFR_MEM8(0x002F)


/* CPU - CPU registers */
#define CPU_CCP  _SFR_MEM8(0x0034)
#define CPU_RAMPD  _SFR_MEM8(0x0038)
#define CPU_RAMPX  _SFR_MEM8(0x0039)
#define CPU_RAMPY  _SFR_MEM8(0x003A)
#define CPU_RAMPZ  _SFR_MEM8(0x003B)
#define CPU_EIND  _SFR_MEM8(0x003C)
#define CPU_SPL  _SFR_MEM8(0x003D)
#define CPU_SPH  _SFR_MEM8(0x003E)
#define CPU_SREG  _SFR_MEM8(0x003F)


/* CLK - Clock System */
#define CLK_CTRL  _SFR_MEM8(0x0040)
#define CLK_PSCTRL  _SFR_MEM8(0x0041)
#define CLK_LOCK  _SFR_MEM8(0x0042)
#define CLK_RTCCTRL  _SFR_MEM8(0x0043)


/* SLEEP - Sleep Controller */
#define SLEEP_CTRL  _SFR_MEM8(0x0048)


/* OSC - Oscillator */
#define OSC_CTRL  _SFR_MEM8(0x0050)
#define OSC_STATUS  _SFR_MEM8(0x0051)
#define OSC_CLOCKINCTRL  _SFR_MEM8(0x0052)
#define OSC_XOSCFAIL  _SFR_MEM8(0x0053)
#define OSC_RC32KCAL  _SFR_MEM8(0x0054)
#define OSC_PLLCTRL  _SFR_MEM8(0x0055)
#define OSC_DFLLCTRL  _SFR_MEM8(0x0056)


/* DFLL (DFLLRC32M) - DFLL */
#define DFLLRC32M_CTRL  _SFR_MEM8(0x0060)
#define DFLLRC32M_CALA  _SFR_MEM8(0x0062)
#define DFLLRC32M_CALB  _SFR_MEM8(0x0063)
#define DFLLRC32M_COMP0  _SFR_MEM8(0x0064)
#define DFLLRC32M_COMP1  _SFR_MEM8(0x0065)
#define DFLLRC32M_COMP2  _SFR_MEM8(0x0066)


/* PR - Power Reduction */
#define PR_PRGEN  _SFR_MEM8(0x0070)
#define PR_PRPA  _SFR_MEM8(0x0071)
#define PR_PRPB  _SFR_MEM8(0x0072)
#define PR_PRPC  _SFR_MEM8(0x0073)
#define PR_PRPD  _SFR_MEM8(0x0074)
#define PR_PRPE  _SFR_MEM8(0x0075)
#define PR_PRPF  _SFR_MEM8(0x0076)


