gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/* RST - Reset */
#define RST_STATUS  _SFR_MEM8(0x0078)
#define RST_CTRL  _SFR_MEM8(0x0079)


/* WDT - Watch-Dog Timer */
#define WDT_CTRL  _SFR_MEM8(0x0080)
#define WDT_WINCTRL  _SFR_MEM8(0x0081)
#define WDT_STATUS  _SFR_MEM8(0x0082)


/* MCU - MCU Control */
#define MCU_DEVID0  _SFR_MEM8(0x0090)
#define MCU_DEVID1  _SFR_MEM8(0x0091)
#define MCU_DEVID2  _SFR_MEM8(0x0092)
#define MCU_REVID  _SFR_MEM8(0x0093)
#define MCU_JTAGUID  _SFR_MEM8(0x0094)
#define MCU_MCUCR  _SFR_MEM8(0x0096)
#define MCU_EVSYSLOCK  _SFR_MEM8(0x0098)
#define MCU_AWEXLOCK  _SFR_MEM8(0x0099)


/* PMIC - Programmable Multi-level Interrupt Controller */
#define PMIC_STATUS  _SFR_MEM8(0x00A0)
#define PMIC_INTPRI  _SFR_MEM8(0x00A1)
#define PMIC_CTRL  _SFR_MEM8(0x00A2)


/* PORTCFG (PORT_CFG) - I/O port Configuration */
#define PORTCFG_MPCMASK  _SFR_MEM8(0x00B0)
#define PORTCFG_VPCTRLA  _SFR_MEM8(0x00B2)
#define PORTCFG_VPCTRLB  _SFR_MEM8(0x00B3)
#define PORTCFG_CLKEVOUT  _SFR_MEM8(0x00B4)


/* NVM - Non-volatile Memory Controller */
#define NVM_ADDR0  _SFR_MEM8(0x01C0)
#define NVM_ADDR1  _SFR_MEM8(0x01C1)
#define NVM_ADDR2  _SFR_MEM8(0x01C2)
#define NVM_DATA0  _SFR_MEM8(0x01C4)
#define NVM_DATA1  _SFR_MEM8(0x01C5)
#define NVM_DATA2  _SFR_MEM8(0x01C6)
#define NVM_CMD  _SFR_MEM8(0x01CA)
#define NVM_CTRLA  _SFR_MEM8(0x01CB)
#define NVM_CTRLB  _SFR_MEM8(0x01CC)
#define NVM_INTCTRL  _SFR_MEM8(0x01CD)
#define NVM_STATUS  _SFR_MEM8(0x01CF)
#define NVM_LOCKBITS  _SFR_MEM8(0x01D0)


/* PWR - Power Control */
#define PWR_PWRCR  _SFR_MEM8(0x01F0)
#define PWR_PWRSR  _SFR_MEM8(0x01F1)


/* RTC - Real-Time Counter */
#define RTC_CTRL  _SFR_MEM8(0x0400)
#define RTC_STATUS  _SFR_MEM8(0x0401)
#define RTC_INTCTRL  _SFR_MEM8(0x0402)
#define RTC_INTFLAGS  _SFR_MEM8(0x0403)
#define RTC_TEMP  _SFR_MEM8(0x0404)
#define RTC_CNT  _SFR_MEM16(0x0408)
#define RTC_CNTL  _SFR_MEM8(0x0408)
#define RTC_CNTH  _SFR_MEM8(0x0409)
#define RTC_PER  _SFR_MEM16(0x040A)
#define RTC_PERL  _SFR_MEM8(0x040A)
#define RTC_PERH  _SFR_MEM8(0x040B)
#define RTC_COMP  _SFR_MEM16(0x040C)
#define RTC_COMPL  _SFR_MEM8(0x040C)
#define RTC_COMPH  _SFR_MEM8(0x040D)


/* TWI (TWIC) - Two-Wire Interface */
#define TWIC_CTRL  _SFR_MEM8(0x0480)
#define TWIC_MASTER_CTRLA  _SFR_MEM8(0x0481)
#define TWIC_MASTER_CTRLB  _SFR_MEM8(0x0482)
#define TWIC_MASTER_CTRLC  _SFR_MEM8(0x0483)
#define TWIC_MASTER_STATUS  _SFR_MEM8(0x0484)
#define TWIC_MASTER_BAUD  _SFR_MEM8(0x0485)
#define TWIC_MASTER_ADDR  _SFR_MEM8(0x0486)
#define TWIC_MASTER_DATA  _SFR_MEM8(0x0487)


#define TWIC_SLAVE_CTRLA  _SFR_MEM8(0x0488)
#define TWIC_SLAVE_CTRLB  _SFR_MEM8(0x0489)
#define TWIC_SLAVE_STATUS  _SFR_MEM8(0x048A)
#define TWIC_SLAVE_ADDR  _SFR_MEM8(0x048B)
#define TWIC_SLAVE_DATA  _SFR_MEM8(0x048C)
#define TWIC_SLAVE_ADDRMASK  _SFR_MEM8(0x048D)




/* PORT (PORTC) - I/O Ports */
#define PORTC_DIR  _SFR_MEM8(0x0640)
#define PORTC_DIRSET  _SFR_MEM8(0x0641)
#define PORTC_DIRCLR  _SFR_MEM8(0x0642)
#define PORTC_DIRTGL  _SFR_MEM8(0x0643)
#define PORTC_OUT  _SFR_MEM8(0x0644)
#define PORTC_OUTSET  _SFR_MEM8(0x0645)
#define PORTC_OUTCLR  _SFR_MEM8(0x0646)
#define PORTC_OUTTGL  _SFR_MEM8(0x0647)
#define PORTC_IN  _SFR_MEM8(0x0648)
#define PORTC_INTCTRL  _SFR_MEM8(0x0649)
#define PORTC_INT0MASK  _SFR_MEM8(0x064A)
#define PORTC_INT1MASK  _SFR_MEM8(0x064B)
#define PORTC_INTFLAGS  _SFR_MEM8(0x064C)
#define PORTC_PIN0CTRL  _SFR_MEM8(0x0650)
#define PORTC_PIN1CTRL  _SFR_MEM8(0x0651)
#define PORTC_PIN2CTRL  _SFR_MEM8(0x0652)
#define PORTC_PIN3CTRL  _SFR_MEM8(0x0653)
#define PORTC_PIN4CTRL  _SFR_MEM8(0x0654)
#define PORTC_PIN5CTRL  _SFR_MEM8(0x0655)
#define PORTC_PIN6CTRL  _SFR_MEM8(0x0656)
#define PORTC_PIN7CTRL  _SFR_MEM8(0x0657)


/* PORT_T (PORTH) - I/O Ports, disableable */
#define PORTH_DIR  _SFR_MEM8(0x06E0)
#define PORTH_DIRSET  _SFR_MEM8(0x06E1)
#define PORTH_DIRCLR  _SFR_MEM8(0x06E2)
#define PORTH_DIRTGL  _SFR_MEM8(0x06E3)
#define PORTH_OUT  _SFR_MEM8(0x06E4)
#define PORTH_OUTSET  _SFR_MEM8(0x06E5)
#define PORTH_OUTCLR  _SFR_MEM8(0x06E6)
#define PORTH_OUTTGL  _SFR_MEM8(0x06E7)
#define PORTH_IN  _SFR_MEM8(0x06E8)
#define PORTH_INTCTRL  _SFR_MEM8(0x06E9)
#define PORTH_INT0MASK  _SFR_MEM8(0x06EA)
#define PORTH_INT1MASK  _SFR_MEM8(0x06EB)
#define PORTH_INTFLAGS  _SFR_MEM8(0x06EC)
#define PORTH_IDISABLE  _SFR_MEM8(0x06ED)
#define PORTH_PULL_UP  _SFR_MEM8(0x06EE)
#define PORTH_PIN0DISABLE  _SFR_MEM8(0x06F0)
#define PORTH_PIN1DISABLE  _SFR_MEM8(0x06F1)
#define PORTH_PIN2DISABLE  _SFR_MEM8(0x06F2)
#define PORTH_PIN3DISABLE  _SFR_MEM8(0x06F3)
#define PORTH_PIN4DISABLE  _SFR_MEM8(0x06F4)
#define PORTH_PIN5DISABLE  _SFR_MEM8(0x06F5)
#define PORTH_PIN6DISABLE  _SFR_MEM8(0x06F6)
#define PORTH_PIN7DISABLE  _SFR_MEM8(0x06F7)


/* PORT_T (PORTJ) - I/O Ports, disableable */
#define PORTJ_DIR  _SFR_MEM8(0x0700)
#define PORTJ_DIRSET  _SFR_MEM8(0x0701)
#define PORTJ_DIRCLR  _SFR_MEM8(0x0702)
#define PORTJ_DIRTGL  _SFR_MEM8(0x0703)
#define PORTJ_OUT  _SFR_MEM8(0x0704)
#define PORTJ_OUTSET  _SFR_MEM8(0x0705)
#define PORTJ_OUTCLR  _SFR_MEM8(0x0706)
#define PORTJ_OUTTGL  _SFR_MEM8(0x0707)
#define PORTJ_IN  _SFR_MEM8(0x0708)
#define PORTJ_INTCTRL  _SFR_MEM8(0x0709)
#define PORTJ_INT0MASK  _SFR_MEM8(0x070A)
#define PORTJ_INT1MASK  _SFR_MEM8(0x070B)
#define PORTJ_INTFLAGS  _SFR_MEM8(0x070C)
#define PORTJ_IDISABLE  _SFR_MEM8(0x070D)
#define PORTJ_PULL_UP  _SFR_MEM8(0x070E)
#define PORTJ_PIN0DISABLE  _SFR_MEM8(0x0710)
#define PORTJ_PIN1DISABLE  _SFR_MEM8(0x0711)
#define PORTJ_PIN2DISABLE  _SFR_MEM8(0x0712)
#define PORTJ_PIN3DISABLE  _SFR_MEM8(0x0713)
#define PORTJ_PIN4DISABLE  _SFR_MEM8(0x0714)
#define PORTJ_PIN5DISABLE  _SFR_MEM8(0x0715)
#define PORTJ_PIN6DISABLE  _SFR_MEM8(0x0716)
#define PORTJ_PIN7DISABLE  _SFR_MEM8(0x0717)


/* PORT_T (PORTK) - I/O Ports, disableable */
#define PORTK_DIR  _SFR_MEM8(0x0720)
#define PORTK_DIRSET  _SFR_MEM8(0x0721)
#define PORTK_DIRCLR  _SFR_MEM8(0x0722)
#define PORTK_DIRTGL  _SFR_MEM8(0x0723)
#define PORTK_OUT  _SFR_MEM8(0x0724)
#define PORTK_OUTSET  _SFR_MEM8(0x0725)
#define PORTK_OUTCLR  _SFR_MEM8(0x0726)
#define PORTK_OUTTGL  _SFR_MEM8(0x0727)
#define PORTK_IN  _SFR_MEM8(0x0728)
#define PORTK_INTCTRL  _SFR_MEM8(0x0729)
#define PORTK_INT0MASK  _SFR_MEM8(0x072A)
#define PORTK_INT1MASK  _SFR_MEM8(0x072B)
#define PORTK_INTFLAGS  _SFR_MEM8(0x072C)
#define PORTK_IDISABLE  _SFR_MEM8(0x072D)
#define PORTK_PULL_UP  _SFR_MEM8(0x072E)
#define PORTK_PIN0DISABLE  _SFR_MEM8(0x0730)
#define PORTK_PIN1DISABLE  _SFR_MEM8(0x0731)
#define PORTK_PIN2DISABLE  _SFR_MEM8(0x0732)
#define PORTK_PIN3DISABLE  _SFR_MEM8(0x0733)
#define PORTK_PIN4DISABLE  _SFR_MEM8(0x0734)
#define PORTK_PIN5DISABLE  _SFR_MEM8(0x0735)
#define PORTK_PIN6DISABLE  _SFR_MEM8(0x0736)
#define PORTK_PIN7DISABLE  _SFR_MEM8(0x0737)


/* PORT_T (PORTL) - I/O Ports, disableable */
#define PORTL_DIR  _SFR_MEM8(0x0740)
#define PORTL_DIRSET  _SFR_MEM8(0x0741)
#define PORTL_DIRCLR  _SFR_MEM8(0x0742)
#define PORTL_DIRTGL  _SFR_MEM8(0x0743)
#define PORTL_OUT  _SFR_MEM8(0x0744)
#define PORTL_OUTSET  _SFR_MEM8(0x0745)
#define PORTL_OUTCLR  _SFR_MEM8(0x0746)
#define PORTL_OUTTGL  _SFR_MEM8(0x0747)
#define PORTL_IN  _SFR_MEM8(0x0748)
#define PORTL_INTCTRL  _SFR_MEM8(0x0749)
#define PORTL_INT0MASK  _SFR_MEM8(0x074A)
#define PORTL_INT1MASK  _SFR_MEM8(0x074B)
#define PORTL_INTFLAGS  _SFR_MEM8(0x074C)
#define PORTL_IDISABLE  _SFR_MEM8(0x074D)
#define PORTL_PULL_UP  _SFR_MEM8(0x074E)
#define PORTL_PIN0DISABLE  _SFR_MEM8(0x0750)
#define PORTL_PIN1DISABLE  _SFR_MEM8(0x0751)
#define PORTL_PIN2DISABLE  _SFR_MEM8(0x0752)
#define PORTL_PIN3DISABLE  _SFR_MEM8(0x0753)
#define PORTL_PIN4DISABLE  _SFR_MEM8(0x0754)
#define PORTL_PIN5DISABLE  _SFR_MEM8(0x0755)
#define PORTL_PIN6DISABLE  _SFR_MEM8(0x0756)
#define PORTL_PIN7DISABLE  _SFR_MEM8(0x0757)


