gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/* TC0 (TCC0) - 16-bit Timer/Counter 0 */
#define TCC0_CTRLA  _SFR_MEM8(0x0800)
#define TCC0_CTRLB  _SFR_MEM8(0x0801)
#define TCC0_CTRLC  _SFR_MEM8(0x0802)
#define TCC0_CTRLD  _SFR_MEM8(0x0803)
#define TCC0_CTRLE  _SFR_MEM8(0x0804)
#define TCC0_INTCTRLA  _SFR_MEM8(0x0806)
#define TCC0_INTCTRLB  _SFR_MEM8(0x0807)
#define TCC0_CTRLFCLR  _SFR_MEM8(0x0808)
#define TCC0_CTRLFSET  _SFR_MEM8(0x0809)
#define TCC0_CTRLGCLR  _SFR_MEM8(0x080A)
#define TCC0_CTRLGSET  _SFR_MEM8(0x080B)
#define TCC0_INTFLAGS  _SFR_MEM8(0x080C)
#define TCC0_TEMP  _SFR_MEM8(0x080F)
#define TCC0_CNT  _SFR_MEM16(0x0820)
#define TCC0_CNTL  _SFR_MEM8(0x0820)
#define TCC0_CNTH  _SFR_MEM8(0x0821)
#define TCC0_PER  _SFR_MEM16(0x0826)
#define TCC0_PERL  _SFR_MEM8(0x0826)
#define TCC0_PERH  _SFR_MEM8(0x0827)
#define TCC0_CCA  _SFR_MEM16(0x0828)
#define TCC0_CCAL  _SFR_MEM8(0x0828)
#define TCC0_CCAH  _SFR_MEM8(0x0829)
#define TCC0_CCB  _SFR_MEM16(0x082A)
#define TCC0_CCBL  _SFR_MEM8(0x082A)
#define TCC0_CCBH  _SFR_MEM8(0x082B)
#define TCC0_CCC  _SFR_MEM16(0x082C)
#define TCC0_CCCL  _SFR_MEM8(0x082C)
#define TCC0_CCCH  _SFR_MEM8(0x082D)
#define TCC0_CCD  _SFR_MEM16(0x082E)
#define TCC0_CCDL  _SFR_MEM8(0x082E)
#define TCC0_CCDH  _SFR_MEM8(0x082F)
#define TCC0_PERBUF  _SFR_MEM16(0x0836)
#define TCC0_PERBUFL  _SFR_MEM8(0x0836)
#define TCC0_PERBUFH  _SFR_MEM8(0x0837)
#define TCC0_CCABUF  _SFR_MEM16(0x0838)
#define TCC0_CCABUFL  _SFR_MEM8(0x0838)
#define TCC0_CCABUFH  _SFR_MEM8(0x0839)
#define TCC0_CCBBUF  _SFR_MEM16(0x083A)
#define TCC0_CCBBUFL  _SFR_MEM8(0x083A)
#define TCC0_CCBBUFH  _SFR_MEM8(0x083B)
#define TCC0_CCCBUF  _SFR_MEM16(0x083C)
#define TCC0_CCCBUFL  _SFR_MEM8(0x083C)
#define TCC0_CCCBUFH  _SFR_MEM8(0x083D)
#define TCC0_CCDBUF  _SFR_MEM16(0x083E)
#define TCC0_CCDBUFL  _SFR_MEM8(0x083E)
#define TCC0_CCDBUFH  _SFR_MEM8(0x083F)


/* TC1 (TCC1) - 16-bit Timer/Counter 1 */
#define TCC1_CTRLA  _SFR_MEM8(0x0840)
#define TCC1_CTRLB  _SFR_MEM8(0x0841)
#define TCC1_CTRLC  _SFR_MEM8(0x0842)
#define TCC1_CTRLD  _SFR_MEM8(0x0843)
#define TCC1_CTRLE  _SFR_MEM8(0x0844)
#define TCC1_INTCTRLA  _SFR_MEM8(0x0846)
#define TCC1_INTCTRLB  _SFR_MEM8(0x0847)
#define TCC1_CTRLFCLR  _SFR_MEM8(0x0848)
#define TCC1_CTRLFSET  _SFR_MEM8(0x0849)
#define TCC1_CTRLGCLR  _SFR_MEM8(0x084A)
#define TCC1_CTRLGSET  _SFR_MEM8(0x084B)
#define TCC1_INTFLAGS  _SFR_MEM8(0x084C)
#define TCC1_TEMP  _SFR_MEM8(0x084F)
#define TCC1_CNT  _SFR_MEM16(0x0860)
#define TCC1_CNTL  _SFR_MEM8(0x0860)
#define TCC1_CNTH  _SFR_MEM8(0x0861)
#define TCC1_PER  _SFR_MEM16(0x0866)
#define TCC1_PERL  _SFR_MEM8(0x0866)
#define TCC1_PERH  _SFR_MEM8(0x0867)
#define TCC1_CCA  _SFR_MEM16(0x0868)
#define TCC1_CCAL  _SFR_MEM8(0x0868)
#define TCC1_CCAH  _SFR_MEM8(0x0869)
#define TCC1_CCB  _SFR_MEM16(0x086A)
#define TCC1_CCBL  _SFR_MEM8(0x086A)
#define TCC1_CCBH  _SFR_MEM8(0x086B)
#define TCC1_PERBUF  _SFR_MEM16(0x0876)
#define TCC1_PERBUFL  _SFR_MEM8(0x0876)
#define TCC1_PERBUFH  _SFR_MEM8(0x0877)
#define TCC1_CCABUF  _SFR_MEM16(0x0878)
#define TCC1_CCABUFL  _SFR_MEM8(0x0878)
#define TCC1_CCABUFH  _SFR_MEM8(0x0879)
#define TCC1_CCBBUF  _SFR_MEM16(0x087A)
#define TCC1_CCBBUFL  _SFR_MEM8(0x087A)
#define TCC1_CCBBUFH  _SFR_MEM8(0x087B)


/* USART (USARTC0) - Universal Synchronous/Asynchronous Receiver/Transmitter */
#define USARTC0_DATA  _SFR_MEM8(0x08A0)
#define USARTC0_STATUS  _SFR_MEM8(0x08A1)
#define USARTC0_CTRLA  _SFR_MEM8(0x08A3)
#define USARTC0_CTRLB  _SFR_MEM8(0x08A4)
#define USARTC0_CTRLC  _SFR_MEM8(0x08A5)
#define USARTC0_BAUDCTRLA  _SFR_MEM8(0x08A6)
#define USARTC0_BAUDCTRLB  _SFR_MEM8(0x08A7)


/* SPI (SPIC) - Serial Peripheral Interface */
#define SPIC_CTRL  _SFR_MEM8(0x08C0)
#define SPIC_INTCTRL  _SFR_MEM8(0x08C1)
#define SPIC_STATUS  _SFR_MEM8(0x08C2)
#define SPIC_DATA  _SFR_MEM8(0x08C3)


/* CTE - CTE Module */
#define CTE_ADCCRA  _SFR_MEM8(0x0C00)
#define CTE_ADCCRB  _SFR_MEM8(0x0C01)
#define CTE_ADCYCHR  _SFR_MEM8(0x0C02)
#define CTE_ADCINTCAL  _SFR_MEM8(0x0C03)
#define CTE_ADCSRACLR  _SFR_MEM8(0x0C04)
#define CTE_ADCSRASET  _SFR_MEM8(0x0C05)
#define CTE_ADCRES  _SFR_MEM8(0x0C06)
#define CTE_ADCINTTEST  _SFR_MEM8(0x0C07)
#define CTE_ADCSHVBCAL  _SFR_MEM8(0x0C08)
#define CTE_INTCRA  _SFR_MEM8(0x0C09)
#define CTE_INTCRBCLR  _SFR_MEM8(0x0C0A)
#define CTE_INTCRBSET  _SFR_MEM8(0x0C0B)
#define CTE_INTFLAGSR  _SFR_MEM8(0x0C0C)
#define CTE_INTXCHR  _SFR_MEM8(0x0C0D)
#define CTE_INTEN  _SFR_MEM8(0x0C0E)
#define CTE_INTOE  _SFR_MEM8(0x0C10)
#define CTE_INTMASKEN  _SFR_MEM8(0x0C11)
#define CTE_SHEN  _SFR_MEM8(0x0C13)
#define CTE_BIASCR  _SFR_MEM8(0x0C14)
#define CTE_TIMAPER  _SFR_MEM8(0x0C15)
#define CTE_TIMBPER  _SFR_MEM8(0x0C16)
#define CTE_TIMCPER  _SFR_MEM8(0x0C17)
#define CTE_TIMMOEPER  _SFR_MEM8(0x0C18)
#define CTE_TIMRSTPER  _SFR_MEM8(0x0C19)
#define CTE_INTTRIG  _SFR_MEM8(0x0C1A)
#define CTE_INTDONE  _SFR_MEM8(0x0C1B)
#define CTE_INTGAIN0  _SFR_MEM8(0x0C1C)
#define CTE_INTGAIN1  _SFR_MEM8(0x0C1D)
#define CTE_INTGAIN2  _SFR_MEM8(0x0C1E)
#define CTE_INTGAIN3  _SFR_MEM8(0x0C1F)
#define CTE_PIFILA  _SFR_MEM8(0x0C20)
#define CTE_PIFILB  _SFR_MEM8(0x0C21)
#define CTE_PIFILE  _SFR_MEM8(0x0C22)
#define CTE_PIFILO  _SFR_MEM8(0x0C23)
#define CTE_PIFXEN  _SFR_MEM8(0x0C24)
#define CTE_PIFYEN  _SFR_MEM8(0x0C25)
#define CTE_PIFXSRL  _SFR_MEM8(0x0C26)
#define CTE_PIFYSRL  _SFR_MEM8(0x0C27)
#define CTE_PIFXPORT  _SFR_MEM8(0x0C28)
#define CTE_PIFYPORT  _SFR_MEM8(0x0C29)
#define CTE_PIFXDDR  _SFR_MEM8(0x0C2A)
#define CTE_PIFYDDR  _SFR_MEM8(0x0C2B)
#define CTE_PIFXPIN  _SFR_MEM8(0x0C2C)
#define CTE_PIFYPIN  _SFR_MEM8(0x0C2D)
#define CTE_PIFXTGL  _SFR_MEM8(0x0C2E)
#define CTE_PIFYTGL  _SFR_MEM8(0x0C2F)
#define CTE_GCAFCRA  _SFR_MEM8(0x0C30)
#define CTE_GCAFCRB  _SFR_MEM8(0x0C31)
#define CTE_GCAFSRA  _SFR_MEM8(0x0C32)
#define CTE_GCAFBASELIM  _SFR_MEM8(0x0C33)
#define CTE_CTTEMP  _SFR_MEM8(0x0C34)
#define CTE_CTCRA  _SFR_MEM8(0x0C35)
#define CTE_MS0_MSCRA  _SFR_MEM8(0x0C44)
#define CTE_MS0_MSCRB  _SFR_MEM8(0x0C45)
#define CTE_MS0_MSSRACLR  _SFR_MEM8(0x0C46)
#define CTE_MS0_MSSRASET  _SFR_MEM8(0x0C47)
#define CTE_MS0_MS0SRB  _SFR_MEM8(0x0C48)
#define CTE_MS0_MSSRC  _SFR_MEM8(0x0C49)
#define CTE_MS0_MSCCR  _SFR_MEM8(0x0C4B)
#define CTE_MS0_MSLRR  _SFR_MEM16(0x0C4E)
#define CTE_MS0_MSPC  _SFR_MEM16(0x0C50)
#define CTE_MS0_MSHIF  _SFR_MEM8(0x0C52)
#define CTE_MS0_MSIR0  _SFR_MEM8(0x0C54)
#define CTE_MS0_MSIR1  _SFR_MEM8(0x0C55)
#define CTE_MS0_MSIR2  _SFR_MEM8(0x0C56)
#define CTE_MS0_MSIR3  _SFR_MEM8(0x0C57)
#define CTE_MS0_MSIRBUF  _SFR_MEM16(0x0C58)
#define CTE_MS0_MSR0  _SFR_MEM16(0x0C5A)


#define CTE_MS1_MSCRA  _SFR_MEM8(0x0C64)
#define CTE_MS1_MSCRB  _SFR_MEM8(0x0C65)
#define CTE_MS1_MSSRACLR  _SFR_MEM8(0x0C66)
#define CTE_MS1_MSSRASET  _SFR_MEM8(0x0C67)
#define CTE_MS1_MS0SRB  _SFR_MEM8(0x0C68)
#define CTE_MS1_MSSRC  _SFR_MEM8(0x0C69)
#define CTE_MS1_MSCCR  _SFR_MEM8(0x0C6B)
#define CTE_MS1_MSLRR  _SFR_MEM16(0x0C6E)
#define CTE_MS1_MSPC  _SFR_MEM16(0x0C70)
#define CTE_MS1_MSHIF  _SFR_MEM8(0x0C72)
#define CTE_MS1_MSIR0  _SFR_MEM8(0x0C74)
#define CTE_MS1_MSIR1  _SFR_MEM8(0x0C75)
#define CTE_MS1_MSIR2  _SFR_MEM8(0x0C76)
#define CTE_MS1_MSIR3  _SFR_MEM8(0x0C77)
#define CTE_MS1_MSIRBUF  _SFR_MEM16(0x0C78)
#define CTE_MS1_MSR0  _SFR_MEM16(0x0C7A)





/*================== Bitfield Definitions ================== */

/* CLK - Clock System */
/* CLK.CTRL  bit masks and bit positions */
#define CLK_SCLKSEL_gm  0x07  /* System Clock Selection group mask. */
#define CLK_SCLKSEL_gp  0  /* System Clock Selection group position. */
#define CLK_SCLKSEL0_bm  (1<<0)  /* System Clock Selection bit 0 mask. */
#define CLK_SCLKSEL0_bp  0  /* System Clock Selection bit 0 position. */
#define CLK_SCLKSEL1_bm  (1<<1)  /* System Clock Selection bit 1 mask. */
#define CLK_SCLKSEL1_bp  1  /* System Clock Selection bit 1 position. */
#define CLK_SCLKSEL2_bm  (1<<2)  /* System Clock Selection bit 2 mask. */
#define CLK_SCLKSEL2_bp  2  /* System Clock Selection bit 2 position. */

/* CLK.PSCTRL  bit masks and bit positions */
#define CLK_PSBCDIV_gm  0x03  /* Prescaler B and C Division factor group mask. */
#define CLK_PSBCDIV_gp  0  /* Prescaler B and C Division factor group position. */
#define CLK_PSBCDIV0_bm  (1<<0)  /* Prescaler B and C Division factor bit 0 mask. */
#define CLK_PSBCDIV0_bp  0  /* Prescaler B and C Division factor bit 0 position. */
#define CLK_PSBCDIV1_bm  (1<<1)  /* Prescaler B and C Division factor bit 1 mask. */
#define CLK_PSBCDIV1_bp  1  /* Prescaler B and C Division factor bit 1 position. */
#define CLK_PSADIV_gm  0x7C  /* Prescaler A Division Factor group mask. */
#define CLK_PSADIV_gp  2  /* Prescaler A Division Factor group position. */
#define CLK_PSADIV0_bm  (1<<2)  /* Prescaler A Division Factor bit 0 mask. */
#define CLK_PSADIV0_bp  2  /* Prescaler A Division Factor bit 0 position. */
#define CLK_PSADIV1_bm  (1<<3)  /* Prescaler A Division Factor bit 1 mask. */
#define CLK_PSADIV1_bp  3  /* Prescaler A Division Factor bit 1 position. */
#define CLK_PSADIV2_bm  (1<<4)  /* Prescaler A Division Factor bit 2 mask. */
#define CLK_PSADIV2_bp  4  /* Prescaler A Division Factor bit 2 position. */
#define CLK_PSADIV3_bm  (1<<5)  /* Prescaler A Division Factor bit 3 mask. */
#define CLK_PSADIV3_bp  5  /* Prescaler A Division Factor bit 3 position. */
#define CLK_PSADIV4_bm  (1<<6)  /* Prescaler A Division Factor bit 4 mask. */
#define CLK_PSADIV4_bp  6  /* Prescaler A Division Factor bit 4 position. */

/* CLK.LOCK  bit masks and bit positions */
#define CLK_LOCK_bm  0x01  /* Clock System Lock bit mask. */
#define CLK_LOCK_bp  0  /* Clock System Lock bit position. */

