gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/* CLK.RTCCTRL  bit masks and bit positions */
#define CLK_RTCEN_bm  0x01  /* RTC Clock Source Enable bit mask. */
#define CLK_RTCEN_bp  0  /* RTC Clock Source Enable bit position. */
#define CLK_RTCSRC_gm  0x0E  /* RTC Clock Source group mask. */
#define CLK_RTCSRC_gp  1  /* RTC Clock Source group position. */
#define CLK_RTCSRC0_bm  (1<<1)  /* RTC Clock Source bit 0 mask. */
#define CLK_RTCSRC0_bp  1  /* RTC Clock Source bit 0 position. */
#define CLK_RTCSRC1_bm  (1<<2)  /* RTC Clock Source bit 1 mask. */
#define CLK_RTCSRC1_bp  2  /* RTC Clock Source bit 1 position. */
#define CLK_RTCSRC2_bm  (1<<3)  /* RTC Clock Source bit 2 mask. */
#define CLK_RTCSRC2_bp  3  /* RTC Clock Source bit 2 position. */

/* PR.PRGEN  bit masks and bit positions */
#define PR_DMA_bm  0x01  /* DMA-Controller bit mask. */
#define PR_DMA_bp  0  /* DMA-Controller bit position. */
#define PR_EVSYS_bm  0x02  /* Event System bit mask. */
#define PR_EVSYS_bp  1  /* Event System bit position. */
#define PR_RTC_bm  0x04  /* Real-time Counter bit mask. */
#define PR_RTC_bp  2  /* Real-time Counter bit position. */
#define PR_EBI_bm  0x08  /* External Bus Interface bit mask. */
#define PR_EBI_bp  3  /* External Bus Interface bit position. */
#define PR_AES_bm  0x10  /* AES bit mask. */
#define PR_AES_bp  4  /* AES bit position. */
#define PR_CTM_bm  0x20  /* CTM bit mask. */
#define PR_CTM_bp  5  /* CTM bit position. */

/* PR.PRPA  bit masks and bit positions */
#define PR_AC_bm  0x01  /* Port A Analog Comparator bit mask. */
#define PR_AC_bp  0  /* Port A Analog Comparator bit position. */
#define PR_ADC_bm  0x02  /* Port A ADC bit mask. */
#define PR_ADC_bp  1  /* Port A ADC bit position. */
#define PR_DAC_bm  0x04  /* Port A DAC bit mask. */
#define PR_DAC_bp  2  /* Port A DAC bit position. */

/* PR.PRPB  bit masks and bit positions */
/* PR_AC  is already defined. */
/* PR_ADC  is already defined. */
/* PR_DAC  is already defined. */

/* PR.PRPC  bit masks and bit positions */
#define PR_TC0_bm  0x01  /* Port C Timer/Counter0 bit mask. */
#define PR_TC0_bp  0  /* Port C Timer/Counter0 bit position. */
#define PR_TC1_bm  0x02  /* Port C Timer/Counter1 bit mask. */
#define PR_TC1_bp  1  /* Port C Timer/Counter1 bit position. */
#define PR_HIRES_bm  0x04  /* Port C AWEX bit mask. */
#define PR_HIRES_bp  2  /* Port C AWEX bit position. */
#define PR_SPI_bm  0x08  /* Port C SPI bit mask. */
#define PR_SPI_bp  3  /* Port C SPI bit position. */
#define PR_USART0_bm  0x10  /* Port C USART0 bit mask. */
#define PR_USART0_bp  4  /* Port C USART0 bit position. */
#define PR_USART1_bm  0x20  /* Port C USART1 bit mask. */
#define PR_USART1_bp  5  /* Port C USART1 bit position. */
#define PR_TWI_bm  0x40  /* Port C Two-wire Interface bit mask. */
#define PR_TWI_bp  6  /* Port C Two-wire Interface bit position. */

/* PR.PRPD  bit masks and bit positions */
/* PR_TC0  is already defined. */
/* PR_TC1  is already defined. */
/* PR_HIRES  is already defined. */
/* PR_SPI  is already defined. */
/* PR_USART0  is already defined. */
/* PR_USART1  is already defined. */
/* PR_TWI  is already defined. */

/* PR.PRPE  bit masks and bit positions */
/* PR_TC0  is already defined. */
/* PR_TC1  is already defined. */
/* PR_HIRES  is already defined. */
/* PR_SPI  is already defined. */
/* PR_USART0  is already defined. */
/* PR_USART1  is already defined. */
/* PR_TWI  is already defined. */

/* PR.PRPF  bit masks and bit positions */
/* PR_TC0  is already defined. */
/* PR_TC1  is already defined. */
/* PR_HIRES  is already defined. */
/* PR_SPI  is already defined. */
/* PR_USART0  is already defined. */
/* PR_USART1  is already defined. */
/* PR_TWI  is already defined. */

/* PWR.PWRCR  bit masks and bit positions */
#define PWR_PWRLVLSEN_bm  0x01  /* Power Control Level Shifter Enable bit mask. */
#define PWR_PWRLVLSEN_bp  0  /* Power Control Level Shifter Enable bit position. */
#define PWR_PWRLVLSDIS_bm  0x02  /* Power Control Level Shifter Disable bit mask. */
#define PWR_PWRLVLSDIS_bp  1  /* Power Control Level Shifter Disable bit position. */
#define PWR_PWRBODEN_bm  0x80  /* Power Control BOD Enable bit mask. */
#define PWR_PWRBODEN_bp  7  /* Power Control BOD Enable bit position. */

/* PWR.PWRSR  bit masks and bit positions */
#define PWR_PWROK_bm  0x01  /* Power OK bit mask. */
#define PWR_PWROK_bp  0  /* Power OK bit position. */
#define PWR_PWRRSTDONE_bm  0x02  /* Power Control Reset Done bit mask. */
#define PWR_PWRRSTDONE_bp  1  /* Power Control Reset Done bit position. */
#define PWR_PWRLVLSS_bm  0x04  /* Power Controller Levelshifter Status bit mask. */
#define PWR_PWRLVLSS_bp  2  /* Power Controller Levelshifter Status bit position. */

/* CPU - CPU */
/* CPU.CCP  bit masks and bit positions */
#define CPU_CCP_gm  0xFF  /* CCP signature group mask. */
#define CPU_CCP_gp  0  /* CCP signature group position. */
#define CPU_CCP0_bm  (1<<0)  /* CCP signature bit 0 mask. */
#define CPU_CCP0_bp  0  /* CCP signature bit 0 position. */
#define CPU_CCP1_bm  (1<<1)  /* CCP signature bit 1 mask. */
#define CPU_CCP1_bp  1  /* CCP signature bit 1 position. */
#define CPU_CCP2_bm  (1<<2)  /* CCP signature bit 2 mask. */
#define CPU_CCP2_bp  2  /* CCP signature bit 2 position. */
#define CPU_CCP3_bm  (1<<3)  /* CCP signature bit 3 mask. */
#define CPU_CCP3_bp  3  /* CCP signature bit 3 position. */
#define CPU_CCP4_bm  (1<<4)  /* CCP signature bit 4 mask. */
#define CPU_CCP4_bp  4  /* CCP signature bit 4 position. */
#define CPU_CCP5_bm  (1<<5)  /* CCP signature bit 5 mask. */
#define CPU_CCP5_bp  5  /* CCP signature bit 5 position. */
#define CPU_CCP6_bm  (1<<6)  /* CCP signature bit 6 mask. */
#define CPU_CCP6_bp  6  /* CCP signature bit 6 position. */
#define CPU_CCP7_bm  (1<<7)  /* CCP signature bit 7 mask. */
#define CPU_CCP7_bp  7  /* CCP signature bit 7 position. */








/* CPU.SREG  bit masks and bit positions */
#define CPU_C_bm  0x01  /* Carry Flag bit mask. */
#define CPU_C_bp  0  /* Carry Flag bit position. */
#define CPU_Z_bm  0x02  /* Zero Flag bit mask. */
#define CPU_Z_bp  1  /* Zero Flag bit position. */
#define CPU_N_bm  0x04  /* Negative Flag bit mask. */
#define CPU_N_bp  2  /* Negative Flag bit position. */
#define CPU_V_bm  0x08  /* Two's Complement Overflow Flag bit mask. */
#define CPU_V_bp  3  /* Two's Complement Overflow Flag bit position. */
#define CPU_S_bm  0x10  /* N Exclusive Or V Flag bit mask. */
#define CPU_S_bp  4  /* N Exclusive Or V Flag bit position. */
#define CPU_H_bm  0x20  /* Half Carry Flag bit mask. */
#define CPU_H_bp  5  /* Half Carry Flag bit position. */
#define CPU_T_bm  0x40  /* Transfer Bit bit mask. */
#define CPU_T_bp  6  /* Transfer Bit bit position. */
#define CPU_I_bm  0x80  /* Global Interrupt Enable Flag bit mask. */
#define CPU_I_bp  7  /* Global Interrupt Enable Flag bit position. */

/* CTE - CTE Module */
/* CTEMS.MSCRA  bit masks and bit positions */
#define CTEMS_MSBE_bm  0x01  /* MS Break Enable bit mask. */
#define CTEMS_MSBE_bp  0  /* MS Break Enable bit position. */
#define CTEMS_MSAM_gm  0x06  /* MS Arbiter Mode group mask. */
#define CTEMS_MSAM_gp  1  /* MS Arbiter Mode group position. */
#define CTEMS_MSAM0_bm  (1<<1)  /* MS Arbiter Mode bit 0 mask. */
#define CTEMS_MSAM0_bp  1  /* MS Arbiter Mode bit 0 position. */
#define CTEMS_MSAM1_bm  (1<<2)  /* MS Arbiter Mode bit 1 mask. */
#define CTEMS_MSAM1_bp  2  /* MS Arbiter Mode bit 1 position. */
#define CTEMS_MSIL_gm  0x18  /* MS Interrupt Level group mask. */
#define CTEMS_MSIL_gp  3  /* MS Interrupt Level group position. */
#define CTEMS_MSIL0_bm  (1<<3)  /* MS Interrupt Level bit 0 mask. */
#define CTEMS_MSIL0_bp  3  /* MS Interrupt Level bit 0 position. */
#define CTEMS_MSIL1_bm  (1<<4)  /* MS Interrupt Level bit 1 mask. */
#define CTEMS_MSIL1_bp  4  /* MS Interrupt Level bit 1 position. */
#define CTEMS_MSIOAE_bm  0x20  /* MS I/O Access Enable bit mask. */
#define CTEMS_MSIOAE_bp  5  /* MS I/O Access Enable bit position. */

/* CTEMS.MSCRB  bit masks and bit positions */
#define CTEMS_MSTCCS_gm  0x03  /* MS Timer/Counter Clock Select group mask. */
#define CTEMS_MSTCCS_gp  0  /* MS Timer/Counter Clock Select group position. */
#define CTEMS_MSTCCS0_bm  (1<<0)  /* MS Timer/Counter Clock Select bit 0 mask. */
#define CTEMS_MSTCCS0_bp  0  /* MS Timer/Counter Clock Select bit 0 position. */
#define CTEMS_MSTCCS1_bm  (1<<1)  /* MS Timer/Counter Clock Select bit 1 mask. */
#define CTEMS_MSTCCS1_bp  1  /* MS Timer/Counter Clock Select bit 1 position. */
#define CTEMS_MSTCRE_bm  0x04  /* MS Timer/Counter Reload Enable bit mask. */
#define CTEMS_MSTCRE_bp  2  /* MS Timer/Counter Reload Enable bit position. */
#define CTEMS_MSSEXT_bm  0x08  /* MS Sign Extend LD[M].B bit mask. */
#define CTEMS_MSSEXT_bp  3  /* MS Sign Extend LD[M].B bit position. */
#define CTEMS_MSDDZC_bm  0x10  /* MS Disable Division By Zero bit mask. */
#define CTEMS_MSDDZC_bp  4  /* MS Disable Division By Zero bit position. */
#define CTEMS_MSSMM_bm  0x20  /* MS Signed MIN/MAX bit mask. */
#define CTEMS_MSSMM_bp  5  /* MS Signed MIN/MAX bit position. */
#define CTEMS_MSSSAT6_bm  0x40  /* MS Signed SAT6 bit mask. */
#define CTEMS_MSSSAT6_bp  6  /* MS Signed SAT6 bit position. */

/* CTEMS.MSSRACLR  bit masks and bit positions */
#define CTEMS_MSTCUNF_bm  0x01  /* MS Timer/Counter Underflow Flag bit mask. */
#define CTEMS_MSTCUNF_bp  0  /* MS Timer/Counter Underflow Flag bit position. */
#define CTEMS_MSHSF_gm  0x1E  /* MS Handshake Flags group mask. */
#define CTEMS_MSHSF_gp  1  /* MS Handshake Flags group position. */
#define CTEMS_MSHSF0_bm  (1<<1)  /* MS Handshake Flags bit 0 mask. */
#define CTEMS_MSHSF0_bp  1  /* MS Handshake Flags bit 0 position. */
#define CTEMS_MSHSF1_bm  (1<<2)  /* MS Handshake Flags bit 1 mask. */
#define CTEMS_MSHSF1_bp  2  /* MS Handshake Flags bit 1 position. */
#define CTEMS_MSHSF2_bm  (1<<3)  /* MS Handshake Flags bit 2 mask. */
#define CTEMS_MSHSF2_bp  3  /* MS Handshake Flags bit 2 position. */
#define CTEMS_MSHSF3_bm  (1<<4)  /* MS Handshake Flags bit 3 mask. */
#define CTEMS_MSHSF3_bp  4  /* MS Handshake Flags bit 3 position. */
#define CTEMS_GCAFCCCNZ_bm  0x20  /* GCAF Computation Complete Counter Not Zero bit mask. */
#define CTEMS_GCAFCCCNZ_bp  5  /* GCAF Computation Complete Counter Not Zero bit position. */
#define CTEMS_GCAFCCCZ_bm  0x40  /* GCAF Computation Complete Counter Zero bit mask. */
#define CTEMS_GCAFCCCZ_bp  6  /* GCAF Computation Complete Counter Zero bit position. */
#define CTEMS_MSADCSYNC_bm  0x80  /* MS ADC Synchronization bit mask. */
#define CTEMS_MSADCSYNC_bp  7  /* MS ADC Synchronization bit position. */

/* CTEMS.MSSRASET  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
/* CTEMS_MSHSF  is already defined. */
/* CTEMS_GCAFCCCNZ  is already defined. */
/* CTEMS_GCAFCCCZ  is already defined. */
/* CTEMS_MSADCSYNC  is already defined. */

/* CTEMS.MS0SRB  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
#define CTEMS_PIFXPIN_gm  0x3E  /* Port Interface X-line Pins group mask. */
#define CTEMS_PIFXPIN_gp  1  /* Port Interface X-line Pins group position. */
#define CTEMS_PIFXPIN0_bm  (1<<1)  /* Port Interface X-line Pins bit 0 mask. */
#define CTEMS_PIFXPIN0_bp  1  /* Port Interface X-line Pins bit 0 position. */
#define CTEMS_PIFXPIN1_bm  (1<<2)  /* Port Interface X-line Pins bit 1 mask. */
#define CTEMS_PIFXPIN1_bp  2  /* Port Interface X-line Pins bit 1 position. */
#define CTEMS_PIFXPIN2_bm  (1<<3)  /* Port Interface X-line Pins bit 2 mask. */
#define CTEMS_PIFXPIN2_bp  3  /* Port Interface X-line Pins bit 2 position. */
#define CTEMS_PIFXPIN3_bm  (1<<4)  /* Port Interface X-line Pins bit 3 mask. */
#define CTEMS_PIFXPIN3_bp  4  /* Port Interface X-line Pins bit 3 position. */
#define CTEMS_PIFXPIN4_bm  (1<<5)  /* Port Interface X-line Pins bit 4 mask. */
#define CTEMS_PIFXPIN4_bp  5  /* Port Interface X-line Pins bit 4 position. */
#define CTEMS_PIFPC2_bm  0x40  /* Port Interface Port C pin 2 bit mask. */
#define CTEMS_PIFPC2_bp  6  /* Port Interface Port C pin 2 bit position. */
#define CTEMS_PIFPC6_bm  0x80  /* Port Interface Port C pin 6 bit mask. */
#define CTEMS_PIFPC6_bp  7  /* Port Interface Port C pin 6 bit position. */

/* CTEMS.MSSRC  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
#define CTEMS_TIMADONE_bm  0x02  /* Timer A Done bit mask. */
#define CTEMS_TIMADONE_bp  1  /* Timer A Done bit position. */
#define CTEMS_TIMBDONE_bm  0x04  /* Timer B Done bit mask. */
#define CTEMS_TIMBDONE_bp  2  /* Timer B Done bit position. */
#define CTEMS_TIMCDONE_bm  0x08  /* Timer C Done bit mask. */
#define CTEMS_TIMCDONE_bp  3  /* Timer C Done bit position. */
#define CTEMS_TIMMOEDONE_bm  0x10  /* Integrator Master Output Enable Timer Done bit mask. */
#define CTEMS_TIMMOEDONE_bp  4  /* Integrator Master Output Enable Timer Done bit position. */
#define CTEMS_TIMRSTDONE_bm  0x20  /* Integrator Reset Timer Done bit mask. */
#define CTEMS_TIMRSTDONE_bp  5  /* Integrator Reset Timer Done bit position. */
#define CTEMS_SHADCDONE_bm  0x40  /* S/H and ADC Trigger bit mask. */
#define CTEMS_SHADCDONE_bp  6  /* S/H and ADC Trigger bit position. */
#define CTEMS_ALLDONE_bm  0x80  /* All Timers Done bit mask. */
#define CTEMS_ALLDONE_bp  7  /* All Timers Done bit position. */

/* CTEMS.MSCCR  bit masks and bit positions */
#define CTEMS_ZB_bm  0x01  /* Zero Byte bit mask. */
#define CTEMS_ZB_bp  0  /* Zero Byte bit position. */
#define CTEMS_CB_bm  0x02  /* Carry Byte bit mask. */
#define CTEMS_CB_bp  1  /* Carry Byte bit position. */
#define CTEMS_SB_bm  0x04  /* Signed Byte bit mask. */
#define CTEMS_SB_bp  2  /* Signed Byte bit position. */
#define CTEMS_ZW_bm  0x08  /* Zero Word bit mask. */
#define CTEMS_ZW_bp  3  /* Zero Word bit position. */
#define CTEMS_CW_bm  0x10  /* Carry Word bit mask. */
#define CTEMS_CW_bp  4  /* Carry Word bit position. */
#define CTEMS_SW_bm  0x20  /* Signed Word bit mask. */
#define CTEMS_SW_bp  5  /* Signed Word bit position. */
#define CTEMS_T_gm  0xC0  /* Temporary flags group mask. */
#define CTEMS_T_gp  6  /* Temporary flags group position. */
#define CTEMS_T0_bm  (1<<6)  /* Temporary flags bit 0 mask. */
#define CTEMS_T0_bp  6  /* Temporary flags bit 0 position. */
#define CTEMS_T1_bm  (1<<7)  /* Temporary flags bit 1 mask. */
#define CTEMS_T1_bp  7  /* Temporary flags bit 1 position. */



/* CTEMS.MSHIF  bit masks and bit positions */
#define CTEMS_MSRUN_bm  0x01  /* MS Run bit mask. */
#define CTEMS_MSRUN_bp  0  /* MS Run bit position. */
#define CTEMS_MSSS_bm  0x02  /* MS Single Step bit mask. */
#define CTEMS_MSSS_bp  1  /* MS Single Step bit position. */
#define CTEMS_MSIF_bm  0x04  /* MS Interrupt Flag bit mask. */
#define CTEMS_MSIF_bp  2  /* MS Interrupt Flag bit position. */







/* CTE.ADCCRA  bit masks and bit positions */
#define CTE_ADCPRESC_gm  0x1F  /* ADC Prescaler group mask. */
#define CTE_ADCPRESC_gp  0  /* ADC Prescaler group position. */
#define CTE_ADCPRESC0_bm  (1<<0)  /* ADC Prescaler bit 0 mask. */
#define CTE_ADCPRESC0_bp  0  /* ADC Prescaler bit 0 position. */
#define CTE_ADCPRESC1_bm  (1<<1)  /* ADC Prescaler bit 1 mask. */
#define CTE_ADCPRESC1_bp  1  /* ADC Prescaler bit 1 position. */
#define CTE_ADCPRESC2_bm  (1<<2)  /* ADC Prescaler bit 2 mask. */
#define CTE_ADCPRESC2_bp  2  /* ADC Prescaler bit 2 position. */
#define CTE_ADCPRESC3_bm  (1<<3)  /* ADC Prescaler bit 3 mask. */
#define CTE_ADCPRESC3_bp  3  /* ADC Prescaler bit 3 position. */
#define CTE_ADCPRESC4_bm  (1<<4)  /* ADC Prescaler bit 4 mask. */
#define CTE_ADCPRESC4_bp  4  /* ADC Prescaler bit 4 position. */
#define CTE_ADCAPS_bm  0x20  /* ADC Auto Power Save bit mask. */
#define CTE_ADCAPS_bp  5  /* ADC Auto Power Save bit position. */
#define CTE_ADCREFSEL_gm  0xC0  /* ADC Reference Select group mask. */
#define CTE_ADCREFSEL_gp  6  /* ADC Reference Select group position. */
#define CTE_ADCREFSEL0_bm  (1<<6)  /* ADC Reference Select bit 0 mask. */
#define CTE_ADCREFSEL0_bp  6  /* ADC Reference Select bit 0 position. */
#define CTE_ADCREFSEL1_bm  (1<<7)  /* ADC Reference Select bit 1 mask. */
#define CTE_ADCREFSEL1_bp  7  /* ADC Reference Select bit 1 position. */

/* CTE.ADCCRB  bit masks and bit positions */
#define CTE_ADCSPEED_gm  0x03  /* ADC Speed Setting group mask. */
#define CTE_ADCSPEED_gp  0  /* ADC Speed Setting group position. */
#define CTE_ADCSPEED0_bm  (1<<0)  /* ADC Speed Setting bit 0 mask. */
#define CTE_ADCSPEED0_bp  0  /* ADC Speed Setting bit 0 position. */
#define CTE_ADCSPEED1_bm  (1<<1)  /* ADC Speed Setting bit 1 mask. */
#define CTE_ADCSPEED1_bp  1  /* ADC Speed Setting bit 1 position. */
#define CTE_ADCPUEN_bm  0x04  /* ADC Pull Enable bit mask. */
#define CTE_ADCPUEN_bp  2  /* ADC Pull Enable bit position. */
#define CTE_SHSPEED_gm  0x18  /* S/H Speed Setting group mask. */
#define CTE_SHSPEED_gp  3  /* S/H Speed Setting group position. */
#define CTE_SHSPEED0_bm  (1<<3)  /* S/H Speed Setting bit 0 mask. */
#define CTE_SHSPEED0_bp  3  /* S/H Speed Setting bit 0 position. */
#define CTE_SHSPEED1_bm  (1<<4)  /* S/H Speed Setting bit 1 mask. */
#define CTE_SHSPEED1_bp  4  /* S/H Speed Setting bit 1 position. */
#define CTE_SHDCS_bm  0x40  /* S/H Dynamic Current Scaling bit mask. */
#define CTE_SHDCS_bp  6  /* S/H Dynamic Current Scaling bit position. */
#define CTE_ADCSUM_bm  0x80  /* ADC Startup Mode bit mask. */
#define CTE_ADCSUM_bp  7  /* ADC Startup Mode bit position. */

/* CTE.ADCYCHR  bit masks and bit positions */
#define CTE_ADCYCH_gm  0x0F  /* ADC Y-Channel group mask. */
#define CTE_ADCYCH_gp  0  /* ADC Y-Channel group position. */
#define CTE_ADCYCH0_bm  (1<<0)  /* ADC Y-Channel bit 0 mask. */
#define CTE_ADCYCH0_bp  0  /* ADC Y-Channel bit 0 position. */
#define CTE_ADCYCH1_bm  (1<<1)  /* ADC Y-Channel bit 1 mask. */
#define CTE_ADCYCH1_bp  1  /* ADC Y-Channel bit 1 position. */
#define CTE_ADCYCH2_bm  (1<<2)  /* ADC Y-Channel bit 2 mask. */
#define CTE_ADCYCH2_bp  2  /* ADC Y-Channel bit 2 position. */
#define CTE_ADCYCH3_bm  (1<<3)  /* ADC Y-Channel bit 3 mask. */
#define CTE_ADCYCH3_bp  3  /* ADC Y-Channel bit 3 position. */
#define CTE_ADCSC_bm  0x10  /* ADC Single Channel Conversion bit mask. */
#define CTE_ADCSC_bp  4  /* ADC Single Channel Conversion bit position. */
#define CTE_ADCAUX_bm  0x20  /* ADC Auxiliary Channel Select bit mask. */
#define CTE_ADCAUX_bp  5  /* ADC Auxiliary Channel Select bit position. */

/* CTE.ADCINTCAL  bit masks and bit positions */
#define CTE_ADCCAL_gm  0xFF  /* ADC Calibration group mask. */
#define CTE_ADCCAL_gp  0  /* ADC Calibration group position. */
#define CTE_ADCCAL0_bm  (1<<0)  /* ADC Calibration bit 0 mask. */
#define CTE_ADCCAL0_bp  0  /* ADC Calibration bit 0 position. */
#define CTE_ADCCAL1_bm  (1<<1)  /* ADC Calibration bit 1 mask. */
#define CTE_ADCCAL1_bp  1  /* ADC Calibration bit 1 position. */
#define CTE_ADCCAL2_bm  (1<<2)  /* ADC Calibration bit 2 mask. */
#define CTE_ADCCAL2_bp  2  /* ADC Calibration bit 2 position. */
#define CTE_ADCCAL3_bm  (1<<3)  /* ADC Calibration bit 3 mask. */
#define CTE_ADCCAL3_bp  3  /* ADC Calibration bit 3 position. */
#define CTE_ADCCAL4_bm  (1<<4)  /* ADC Calibration bit 4 mask. */
#define CTE_ADCCAL4_bp  4  /* ADC Calibration bit 4 position. */
#define CTE_ADCCAL5_bm  (1<<5)  /* ADC Calibration bit 5 mask. */
#define CTE_ADCCAL5_bp  5  /* ADC Calibration bit 5 position. */
#define CTE_ADCCAL6_bm  (1<<6)  /* ADC Calibration bit 6 mask. */
#define CTE_ADCCAL6_bp  6  /* ADC Calibration bit 6 position. */
#define CTE_ADCCAL7_bm  (1<<7)  /* ADC Calibration bit 7 mask. */
#define CTE_ADCCAL7_bp  7  /* ADC Calibration bit 7 position. */

/* CTE.ADCSRACLR  bit masks and bit positions */
#define CTE_ADCLC_bm  0x01  /* ADC Last Conversion Result bit mask. */
#define CTE_ADCLC_bp  0  /* ADC Last Conversion Result bit position. */
#define CTE_ADCLCX_bm  0x02  /* ADC Last Conversion Result in X-line bit mask. */
#define CTE_ADCLCX_bp  1  /* ADC Last Conversion Result in X-line bit position. */
#define CTE_ADCVC_bm  0x04  /* ADC Valid Conversion Result bit mask. */
#define CTE_ADCVC_bp  2  /* ADC Valid Conversion Result bit position. */
#define CTE_ADCPS_bm  0x08  /* ADC Power Save bit mask. */
#define CTE_ADCPS_bp  3  /* ADC Power Save bit position. */
#define CTE_ADCBUSY_bm  0x10  /* ADC Busy bit mask. */
#define CTE_ADCBUSY_bp  4  /* ADC Busy bit position. */
#define CTE_ADCPIPEBUSY_bm  0x20  /* ADC Pipeline Busy bit mask. */
#define CTE_ADCPIPEBUSY_bp  5  /* ADC Pipeline Busy bit position. */
#define CTE_ADCANAPIPEBUSY_bm  0x40  /* ADC Analog Pipeline Busy bit mask. */
#define CTE_ADCANAPIPEBUSY_bp  6  /* ADC Analog Pipeline Busy bit position. */

/* CTE.ADCSRASET  bit masks and bit positions */
/* CTE_ADCLC  is already defined. */
/* CTE_ADCLCX  is already defined. */
/* CTE_ADCVC  is already defined. */
/* CTE_ADCPS  is already defined. */
/* CTE_ADCBUSY  is already defined. */
/* CTE_ADCPIPEBUSY  is already defined. */
/* CTE_ADCANAPIPEBUSY  is already defined. */

/* CTE.ADCRES  bit masks and bit positions */
#define CTE_ADCRES_7_0_gm  0xFF  /* ADC Conversion Result bit 7-0 group mask. */
#define CTE_ADCRES_7_0_gp  0  /* ADC Conversion Result bit 7-0 group position. */
#define CTE_ADCRES_7_00_bm  (1<<0)  /* ADC Conversion Result bit 7-0 bit 0 mask. */
#define CTE_ADCRES_7_00_bp  0  /* ADC Conversion Result bit 7-0 bit 0 position. */
#define CTE_ADCRES_7_01_bm  (1<<1)  /* ADC Conversion Result bit 7-0 bit 1 mask. */
#define CTE_ADCRES_7_01_bp  1  /* ADC Conversion Result bit 7-0 bit 1 position. */
#define CTE_ADCRES_7_02_bm  (1<<2)  /* ADC Conversion Result bit 7-0 bit 2 mask. */
#define CTE_ADCRES_7_02_bp  2  /* ADC Conversion Result bit 7-0 bit 2 position. */
#define CTE_ADCRES_7_03_bm  (1<<3)  /* ADC Conversion Result bit 7-0 bit 3 mask. */
#define CTE_ADCRES_7_03_bp  3  /* ADC Conversion Result bit 7-0 bit 3 position. */
#define CTE_ADCRES_7_04_bm  (1<<4)  /* ADC Conversion Result bit 7-0 bit 4 mask. */
#define CTE_ADCRES_7_04_bp  4  /* ADC Conversion Result bit 7-0 bit 4 position. */
#define CTE_ADCRES_7_05_bm  (1<<5)  /* ADC Conversion Result bit 7-0 bit 5 mask. */
#define CTE_ADCRES_7_05_bp  5  /* ADC Conversion Result bit 7-0 bit 5 position. */
#define CTE_ADCRES_7_06_bm  (1<<6)  /* ADC Conversion Result bit 7-0 bit 6 mask. */
#define CTE_ADCRES_7_06_bp  6  /* ADC Conversion Result bit 7-0 bit 6 position. */
#define CTE_ADCRES_7_07_bm  (1<<7)  /* ADC Conversion Result bit 7-0 bit 7 mask. */
#define CTE_ADCRES_7_07_bp  7  /* ADC Conversion Result bit 7-0 bit 7 position. */

/* CTE.ADCINTTEST  bit masks and bit positions */
#define CTE_ADCSPEN_bm  0x01  /* ADC Test Switch Positive Enable bit mask. */
#define CTE_ADCSPEN_bp  0  /* ADC Test Switch Positive Enable bit position. */
#define CTE_ADCSNEN_bm  0x02  /* ADC Test Switch Negative Enable bit mask. */
#define CTE_ADCSNEN_bp  1  /* ADC Test Switch Negative Enable bit position. */
#define CTE_ADCFV_bm  0x04  /* ADC Force Valid Result bit mask. */
#define CTE_ADCFV_bp  2  /* ADC Force Valid Result bit position. */
#define CTE_ADCBTESTEN_bm  0x08  /* ADC Bias Test Enable bit mask. */
#define CTE_ADCBTESTEN_bp  3  /* ADC Bias Test Enable bit position. */
#define CTE_INTBIST_bm  0x10  /* Integrator Built-In Self Test bit mask. */
#define CTE_INTBIST_bp  4  /* Integrator Built-In Self Test bit position. */
#define CTE_INTTESTALL_bm  0x20  /* Integrator Test All bit mask. */
#define CTE_INTTESTALL_bp  5  /* Integrator Test All bit position. */

