gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt224e.h
/* CTE.ADCSHVBCAL  bit masks and bit positions */
#define CTE_ADCVBCAL_gm  0x0F  /* ADC VBias Calibration group mask. */
#define CTE_ADCVBCAL_gp  0  /* ADC VBias Calibration group position. */
#define CTE_ADCVBCAL0_bm  (1<<0)  /* ADC VBias Calibration bit 0 mask. */
#define CTE_ADCVBCAL0_bp  0  /* ADC VBias Calibration bit 0 position. */
#define CTE_ADCVBCAL1_bm  (1<<1)  /* ADC VBias Calibration bit 1 mask. */
#define CTE_ADCVBCAL1_bp  1  /* ADC VBias Calibration bit 1 position. */
#define CTE_ADCVBCAL2_bm  (1<<2)  /* ADC VBias Calibration bit 2 mask. */
#define CTE_ADCVBCAL2_bp  2  /* ADC VBias Calibration bit 2 position. */
#define CTE_ADCVBCAL3_bm  (1<<3)  /* ADC VBias Calibration bit 3 mask. */
#define CTE_ADCVBCAL3_bp  3  /* ADC VBias Calibration bit 3 position. */
#define CTE_ADCVBSEL_bm  0x10  /* ADC VBias Select bit mask. */
#define CTE_ADCVBSEL_bp  4  /* ADC VBias Select bit position. */
#define CTE_SHVBCAL_gm  0xE0  /* S/H VBias Calibration group mask. */
#define CTE_SHVBCAL_gp  5  /* S/H VBias Calibration group position. */
#define CTE_SHVBCAL0_bm  (1<<5)  /* S/H VBias Calibration bit 0 mask. */
#define CTE_SHVBCAL0_bp  5  /* S/H VBias Calibration bit 0 position. */
#define CTE_SHVBCAL1_bm  (1<<6)  /* S/H VBias Calibration bit 1 mask. */
#define CTE_SHVBCAL1_bp  6  /* S/H VBias Calibration bit 1 position. */
#define CTE_SHVBCAL2_bm  (1<<7)  /* S/H VBias Calibration bit 2 mask. */
#define CTE_SHVBCAL2_bp  7  /* S/H VBias Calibration bit 2 position. */

/* CTE.INTCRA  bit masks and bit positions */
#define CTE_INTMEN_bm  0x01  /* Integrator Master Enable bit mask. */
#define CTE_INTMEN_bp  0  /* Integrator Master Enable bit position. */
#define CTE_INTARST_bm  0x02  /* Integrator Automatic Reset bit mask. */
#define CTE_INTARST_bp  1  /* Integrator Automatic Reset bit position. */
#define CTE_INTAST_bm  0x04  /* Integrator Automatic Sign Toggle bit mask. */
#define CTE_INTAST_bp  2  /* Integrator Automatic Sign Toggle bit position. */
#define CTE_INTRSTLVL_gm  0x38  /* Integrator Reset Level group mask. */
#define CTE_INTRSTLVL_gp  3  /* Integrator Reset Level group position. */
#define CTE_INTRSTLVL0_bm  (1<<3)  /* Integrator Reset Level bit 0 mask. */
#define CTE_INTRSTLVL0_bp  3  /* Integrator Reset Level bit 0 position. */
#define CTE_INTRSTLVL1_bm  (1<<4)  /* Integrator Reset Level bit 1 mask. */
#define CTE_INTRSTLVL1_bp  4  /* Integrator Reset Level bit 1 position. */
#define CTE_INTRSTLVL2_bm  (1<<5)  /* Integrator Reset Level bit 2 mask. */
#define CTE_INTRSTLVL2_bp  5  /* Integrator Reset Level bit 2 position. */
#define CTE_INTINCBIAS_bm  0x40  /* Integrator Increase Bias bit mask. */
#define CTE_INTINCBIAS_bp  6  /* Integrator Increase Bias bit position. */
#define CTE_INTXCHINC_bm  0x80  /* Integrator X-Channel Increment bit mask. */
#define CTE_INTXCHINC_bp  7  /* Integrator X-Channel Increment bit position. */

/* CTE.INTCRBCLR  bit masks and bit positions */
#define CTE_INTSIGN_bm  0x01  /* Integrator Sign bit mask. */
#define CTE_INTSIGN_bp  0  /* Integrator Sign bit position. */
#define CTE_TIMA_bm  0x02  /* Timer A Output bit mask. */
#define CTE_TIMA_bp  1  /* Timer A Output bit position. */
#define CTE_TIMB_bm  0x04  /* Timer B Output bit mask. */
#define CTE_TIMB_bp  2  /* Timer B Output bit position. */
#define CTE_TIMC_bm  0x08  /* Timer C Output bit mask. */
#define CTE_TIMC_bp  3  /* Timer C Output bit position. */
#define CTE_INTMOE_bm  0x10  /* Integrator Master Output Enable bit mask. */
#define CTE_INTMOE_bp  4  /* Integrator Master Output Enable bit position. */
#define CTE_INTRST_bm  0x20  /* Integrator Reset bit mask. */
#define CTE_INTRST_bp  5  /* Integrator Reset bit position. */
#define CTE_SHADC_bm  0x40  /* S/H and ADC Pending bit mask. */
#define CTE_SHADC_bp  6  /* S/H and ADC Pending bit position. */

/* CTE.INTCRBSET  bit masks and bit positions */
/* CTE_INTSIGN  is already defined. */
/* CTE_TIMA  is already defined. */
/* CTE_TIMB  is already defined. */
/* CTE_TIMC  is already defined. */
/* CTE_INTMOE  is already defined. */
/* CTE_INTRST  is already defined. */
/* CTE_SHADC  is already defined. */







/* CTE.BIASCR  bit masks and bit positions */
#define CTE_BIASXPVAL_gm  0x1F  /* X-line PMOS Bias Value group mask. */
#define CTE_BIASXPVAL_gp  0  /* X-line PMOS Bias Value group position. */
#define CTE_BIASXPVAL0_bm  (1<<0)  /* X-line PMOS Bias Value bit 0 mask. */
#define CTE_BIASXPVAL0_bp  0  /* X-line PMOS Bias Value bit 0 position. */
#define CTE_BIASXPVAL1_bm  (1<<1)  /* X-line PMOS Bias Value bit 1 mask. */
#define CTE_BIASXPVAL1_bp  1  /* X-line PMOS Bias Value bit 1 position. */
#define CTE_BIASXPVAL2_bm  (1<<2)  /* X-line PMOS Bias Value bit 2 mask. */
#define CTE_BIASXPVAL2_bp  2  /* X-line PMOS Bias Value bit 2 position. */
#define CTE_BIASXPVAL3_bm  (1<<3)  /* X-line PMOS Bias Value bit 3 mask. */
#define CTE_BIASXPVAL3_bp  3  /* X-line PMOS Bias Value bit 3 position. */
#define CTE_BIASXPVAL4_bm  (1<<4)  /* X-line PMOS Bias Value bit 4 mask. */
#define CTE_BIASXPVAL4_bp  4  /* X-line PMOS Bias Value bit 4 position. */
#define CTE_BIASXNVAL_2_0_gm  0xE0  /* X-line NMOS Bias Value bit 2-0 group mask. */
#define CTE_BIASXNVAL_2_0_gp  5  /* X-line NMOS Bias Value bit 2-0 group position. */
#define CTE_BIASXNVAL_2_00_bm  (1<<5)  /* X-line NMOS Bias Value bit 2-0 bit 0 mask. */
#define CTE_BIASXNVAL_2_00_bp  5  /* X-line NMOS Bias Value bit 2-0 bit 0 position. */
#define CTE_BIASXNVAL_2_01_bm  (1<<6)  /* X-line NMOS Bias Value bit 2-0 bit 1 mask. */
#define CTE_BIASXNVAL_2_01_bp  6  /* X-line NMOS Bias Value bit 2-0 bit 1 position. */
#define CTE_BIASXNVAL_2_02_bm  (1<<7)  /* X-line NMOS Bias Value bit 2-0 bit 2 mask. */
#define CTE_BIASXNVAL_2_02_bp  7  /* X-line NMOS Bias Value bit 2-0 bit 2 position. */

/* CTE.TIMAPER  bit masks and bit positions */
#define CTE_TIMAPER_7_0_gm  0xFF  /* Timer A Period bit 7-0 group mask. */
#define CTE_TIMAPER_7_0_gp  0  /* Timer A Period bit 7-0 group position. */
#define CTE_TIMAPER_7_00_bm  (1<<0)  /* Timer A Period bit 7-0 bit 0 mask. */
#define CTE_TIMAPER_7_00_bp  0  /* Timer A Period bit 7-0 bit 0 position. */
#define CTE_TIMAPER_7_01_bm  (1<<1)  /* Timer A Period bit 7-0 bit 1 mask. */
#define CTE_TIMAPER_7_01_bp  1  /* Timer A Period bit 7-0 bit 1 position. */
#define CTE_TIMAPER_7_02_bm  (1<<2)  /* Timer A Period bit 7-0 bit 2 mask. */
#define CTE_TIMAPER_7_02_bp  2  /* Timer A Period bit 7-0 bit 2 position. */
#define CTE_TIMAPER_7_03_bm  (1<<3)  /* Timer A Period bit 7-0 bit 3 mask. */
#define CTE_TIMAPER_7_03_bp  3  /* Timer A Period bit 7-0 bit 3 position. */
#define CTE_TIMAPER_7_04_bm  (1<<4)  /* Timer A Period bit 7-0 bit 4 mask. */
#define CTE_TIMAPER_7_04_bp  4  /* Timer A Period bit 7-0 bit 4 position. */
#define CTE_TIMAPER_7_05_bm  (1<<5)  /* Timer A Period bit 7-0 bit 5 mask. */
#define CTE_TIMAPER_7_05_bp  5  /* Timer A Period bit 7-0 bit 5 position. */
#define CTE_TIMAPER_7_06_bm  (1<<6)  /* Timer A Period bit 7-0 bit 6 mask. */
#define CTE_TIMAPER_7_06_bp  6  /* Timer A Period bit 7-0 bit 6 position. */
#define CTE_TIMAPER_7_07_bm  (1<<7)  /* Timer A Period bit 7-0 bit 7 mask. */
#define CTE_TIMAPER_7_07_bp  7  /* Timer A Period bit 7-0 bit 7 position. */

